// CommunicationsApi
//
// Класс сформирован автоматически (onescript) из спецификации OpenAPI.
// Правки будут потеряны при следующей генерации.
//
// Пример:
//   Настройки = Новый Конфигурация();
//   Настройки.УстановитьТокен("...");
//   Клиент = Новый CommunicationsApi(Настройки);

Перем Настройки Экспорт;
Перем Транспорт Экспорт;

Процедура ПриСозданииОбъекта(Знач ВходящиеНастройки)
	Настройки = ВходящиеНастройки;
	Транспорт = Новый ТранспортHTTP(Настройки);
КонецПроцедуры

// Открепить отзывы
//
// Метод позволяет открепить отзывы в карточке товара или в группе [объединённых](https://dev.wildberries.ru/knowledge-base/articles/019d49a4-1320-71bb-9dac-8ba07e7177ce/rabota-s-tovarami#obuedinenie-i-razuedinenie-kartochek-tovarov) карточек.
// Чтобы получить `pinId` — ID операций закрепления, используйте метод [Список закреплённых и откреплённых отзывов](https://dev.wildberries.ru/openapi/customer-communication#tag/pinnedFeedbacks/operation/getV1Pins).
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для всех методов категории **Вопросы и отзывы**:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Сервисный | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Базовый с секретом | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Базовый | 1 ч | 5 запросов | 12 мин | 1 запрос |
//
// Library doc: https://valeryverkhoturov.github.io/wb-api-client-docs/reference/api/communications/delete-api-feedbacks-v1-pins
//
// Параметры:
//   Тело - Массив - Список `pinId` — ID операций закрепления отзывов
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция DeleteV1Pins(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"DELETE",
		"/api/feedbacks/v1/pins",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://feedbacks-api.wildberries.ru");

КонецФункции

// Заявки покупателей на возврат
//
// Метод возвращает заявки покупателей на возврат товаров за последние 14 дней. Вы можете [отвечать на эти заявки](https://dev.wildberries.ru/openapi/customer-communication#tag/buyersReturns/operation/patchV1Claim).
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 20 запросов | 3 сек | 10 запросов |
// | Сервисный | 1 мин | 20 запросов | 3 сек | 10 запросов |
// | Базовый с секретом | 1 мин | 20 запросов | 3 сек | 10 запросов |
// | Базовый | 1 ч | 1 запрос | 1 ч | 1 запрос |
//
// Library doc: https://valeryverkhoturov.github.io/wb-api-client-docs/reference/api/communications/get-api-v1-claims
//
// Параметры:
//   is_archive - Булево - Состояние заявки: * `false` — на рассмотрении * `true` — в архиве
//   ДопПараметры - Структура, Соответствие - необязательные параметры:
//    * id - Строка - ID заявки
//    * limit - Число - Количество заявок в ответе
//    * offset - Число - После какого элемента выдавать данные
//    * nm_id - Число - Артикул WB
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1Claims(Знач is_archive, Знач ДопПараметры = Неопределено) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("is_archive", is_archive);
	Заголовки = Новый Соответствие;

	ИменаЗаголовков = Новый Массив;
	Транспорт.РазложитьПараметры(ДопПараметры, ИменаЗаголовков, ПараметрыЗапроса, Заголовки);
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/v1/claims",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://returns-api.wildberries.ru");

КонецФункции

// Получить отзыв по ID
//
// Метод возвращает данные [отзыва](https://dev.wildberries.ru/openapi/customer-communication#tag/feedbacks/operation/getV1Feedbacks) по его ID.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для всех методов категории **Вопросы и отзывы**:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Сервисный | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Базовый с секретом | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Базовый | 1 ч | 5 запросов | 12 мин | 1 запрос |
//
// Library doc: https://valeryverkhoturov.github.io/wb-api-client-docs/reference/api/communications/get-api-v1-feedback
//
// Параметры:
//   id - Строка - ID отзыва
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1Feedback(Знач id) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("id", id);
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/v1/feedback",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://feedbacks-api.wildberries.ru");

КонецФункции

// Список отзывов
//
// Метод возвращает список отзывов по заданным фильтрам. Вы можете:
// - получить данные обработанных и необработанных отзывов.
// Отзыв считается обработанным, если выполняется одно из условий:
// - на отзыв получен ответ
// - отзыв содержит только оценку (без текста и фото)
// - сортировать отзывы по дате
// - настроить пагинацию и количество отзывов в ответе
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для всех методов категории **Вопросы и отзывы**:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Сервисный | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Базовый с секретом | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Базовый | 1 ч | 5 запросов | 12 мин | 1 запрос |
//
// Library doc: https://valeryverkhoturov.github.io/wb-api-client-docs/reference/api/communications/get-api-v1-feedbacks
//
// Параметры:
//   isAnswered - Булево - Вернуть только обработанные отзывы: - `true` — да - `false` — нет
//   take - Число - Количество отзывов (max. 5 000)
//   skip - Число - Количество отзывов для пропуска (max. 199990)
//   ДопПараметры - Структура, Соответствие - необязательные параметры:
//    * nmId - Число - Артикул WB
//    * order - Строка - Сортировка отзывов по дате (dateAsc/dateDesc)
//    * dateFrom - Число - Дата начала периода в формате Unix timestamp
//    * dateTo - Число - Дата конца периода в формате Unix timestamp
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1Feedbacks(Знач isAnswered, Знач take, Знач skip, Знач ДопПараметры = Неопределено) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("isAnswered", isAnswered);
	ПараметрыЗапроса.Вставить("take", take);
	ПараметрыЗапроса.Вставить("skip", skip);
	Заголовки = Новый Соответствие;

	ИменаЗаголовков = Новый Массив;
	Транспорт.РазложитьПараметры(ДопПараметры, ИменаЗаголовков, ПараметрыЗапроса, Заголовки);
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/v1/feedbacks",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://feedbacks-api.wildberries.ru");

КонецФункции

// Список архивных отзывов
//
// Метод возвращает список архивных [отзывов](https://dev.wildberries.ru/openapi/customer-communication#tag/feedbacks/operation/getV1Feedbacks).
//
// Отзыв становится архивным, если:
// - на отзыв получен ответ
// - на отзыв не получен ответ в течение 30 дней
// - в отзыве нет текста и фото
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для всех методов категории **Вопросы и отзывы**:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Сервисный | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Базовый с секретом | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Базовый | 1 ч | 5 запросов | 12 мин | 1 запрос |
//
// Library doc: https://valeryverkhoturov.github.io/wb-api-client-docs/reference/api/communications/get-api-v1-feedbacks-archive
//
// Параметры:
//   take - Число - Количество отзывов (max. 5 000)
//   skip - Число - Количество отзывов для пропуска
//   ДопПараметры - Структура, Соответствие - необязательные параметры:
//    * nmId - Число - Артикул WB
//    * order - Строка - Сортировка отзывов по дате (dateAsc/dateDesc)
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1FeedbacksArchive(Знач take, Знач skip, Знач ДопПараметры = Неопределено) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("take", take);
	ПараметрыЗапроса.Вставить("skip", skip);
	Заголовки = Новый Соответствие;

	ИменаЗаголовков = Новый Массив;
	Транспорт.РазложитьПараметры(ДопПараметры, ИменаЗаголовков, ПараметрыЗапроса, Заголовки);
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/v1/feedbacks/archive",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://feedbacks-api.wildberries.ru");

КонецФункции

// Количество отзывов
//
// Метод возвращает количество обработанных или необработанных [отзывов](https://dev.wildberries.ru/openapi/customer-communication#tag/feedbacks/operation/getV1Feedbacks) за заданный период.
// Отзыв считается обработанным, если выполняется одно из условий:
// - на отзыв получен ответ
// - отзыв содержит только оценку (без текста и фото)
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для всех методов категории **Вопросы и отзывы**:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Сервисный | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Базовый с секретом | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Базовый | 1 ч | 5 запросов | 12 мин | 1 запрос |
//
// Library doc: https://valeryverkhoturov.github.io/wb-api-client-docs/reference/api/communications/get-api-v1-feedbacks-count
//
// Параметры:
//   isAnswered - Булево - Вернуть только обработанные отзывы: - `true` — да - `false` — нет
//   ДопПараметры - Структура, Соответствие - необязательные параметры:
//    * dateFrom - Число - Дата начала периода в формате Unix timestamp
//    * dateTo - Число - Дата конца периода в формате Unix timestamp
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1FeedbacksCount(Знач isAnswered, Знач ДопПараметры = Неопределено) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("isAnswered", isAnswered);
	Заголовки = Новый Соответствие;

	ИменаЗаголовков = Новый Массив;
	Транспорт.РазложитьПараметры(ДопПараметры, ИменаЗаголовков, ПараметрыЗапроса, Заголовки);
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/v1/feedbacks/count",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://feedbacks-api.wildberries.ru");

КонецФункции

// Необработанные отзывы
//
// Метод возвращает:
// - количество необработанных [отзывов](https://dev.wildberries.ru/openapi/customer-communication#tag/feedbacks/operation/getV1Feedbacks) за сегодня и за всё время
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для всех методов категории **Вопросы и отзывы**:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Сервисный | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Базовый с секретом | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Базовый | 1 ч | 5 запросов | 12 мин | 1 запрос |
//
// Library doc: https://valeryverkhoturov.github.io/wb-api-client-docs/reference/api/communications/get-api-v1-feedbacks-count-unanswered
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1FeedbacksCountUnanswered() Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/v1/feedbacks/count-unanswered",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://feedbacks-api.wildberries.ru");

КонецФункции

// Непросмотренные отзывы и вопросы
//
// Метод проверяет наличие непросмотренных [вопросов](https://dev.wildberries.ru/openapi/customer-communication#tag/questions/operation/getV1Questions) и [отзывов](https://dev.wildberries.ru/openapi/customer-communication#tag/feedbacks/operation/getV1Feedbacks) от покупателей. Если у продавца есть непросмотренные вопросы или отзывы, возвращает `true`.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для всех методов категории **Вопросы и отзывы**:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Сервисный | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Базовый с секретом | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Базовый | 1 ч | 5 запросов | 12 мин | 1 запрос |
//
// Library doc: https://valeryverkhoturov.github.io/wb-api-client-docs/reference/api/communications/get-api-v1-new-feedbacks-questions
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1NewFeedbacksQuestions() Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/v1/new-feedbacks-questions",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://feedbacks-api.wildberries.ru");

КонецФункции

// Список закреплённых и откреплённых отзывов
//
// Метод предоставляет список закреплённых и откреплённых отзывов.
//
// Откреплёнными считаются только отзывы, которые были откреплены автоматически по причинам, указанным в ответе в поле `unpinnedCause`.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для всех методов категории **Вопросы и отзывы**:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Сервисный | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Базовый с секретом | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Базовый | 1 ч | 5 запросов | 12 мин | 1 запрос |
//
// Library doc: https://valeryverkhoturov.github.io/wb-api-client-docs/reference/api/communications/get-api-feedbacks-v1-pins
//
// Параметры:
//   ДопПараметры - Структура, Соответствие - необязательные параметры:
//    * state - Строка - Закреплён ли отзыв: - `pinned` — да - `unpinned` — нет
//    * pinOn - Строка - Место закрепления отзыва: - `nm` — карточка товара - `imt` — группа [объединённых](https://dev.wildberries.ru/knowledge-base/articles/019d49a4-1320-71bb-9dac-8b…
//    * imtId - Число - ID для [объединённых](https://dev.wildberries.ru/knowledge-base/articles/019d49a4-1320-71bb-9dac-8ba07e7177ce/rabota-s-tovarami#obuedinenie-i-razuedinenie-karto…
//    * nmId - Число - Артикул WB
//    * feedbackId - Число - ID отзыва
//    * dateFrom - Строка - Дата закрепления первого отзыва в списке
//    * dateTo - Строка - Дата закрепления последнего отзыва в списке
//    * next - Число - ID последней операции закрепления (пагинатор)
//    * limit - Число - Количество отзывов на одной странице (пагинация)
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1Pins(Знач ДопПараметры = Неопределено) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;

	ИменаЗаголовков = Новый Массив;
	Транспорт.РазложитьПараметры(ДопПараметры, ИменаЗаголовков, ПараметрыЗапроса, Заголовки);
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/feedbacks/v1/pins",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://feedbacks-api.wildberries.ru");

КонецФункции

// Количество закреплённых и откреплённых отзывов
//
// Метод возвращает количество закреплённых и откреплённых отзывов за заданный период.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для всех методов категории **Вопросы и отзывы**:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Сервисный | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Базовый с секретом | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Базовый | 1 ч | 5 запросов | 12 мин | 1 запрос |
//
// Library doc: https://valeryverkhoturov.github.io/wb-api-client-docs/reference/api/communications/get-api-feedbacks-v1-pins-count
//
// Параметры:
//   ДопПараметры - Структура, Соответствие - необязательные параметры:
//    * state - Строка - Закреплён ли отзыв: - `pinned` — да - `unpinned` — нет
//    * pinOn - Строка - Место закрепления отзыва: - `nm` — карточка товара - `imt` — группа [объединённых](https://dev.wildberries.ru/knowledge-base/articles/019d49a4-1320-71bb-9dac-8b…
//    * imtId - Число - ID для [объединённых](https://dev.wildberries.ru/knowledge-base/articles/019d49a4-1320-71bb-9dac-8ba07e7177ce/rabota-s-tovarami#obuedinenie-i-razuedinenie-karto…
//    * nmId - Число - Артикул WB
//    * feedbackId - Число - ID отзыва
//    * dateFrom - Строка - Дата закрепления первого отзыва в списке
//    * dateTo - Строка - Дата закрепления последнего отзыва в списке
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1PinsCount(Знач ДопПараметры = Неопределено) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;

	ИменаЗаголовков = Новый Массив;
	Транспорт.РазложитьПараметры(ДопПараметры, ИменаЗаголовков, ПараметрыЗапроса, Заголовки);
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/feedbacks/v1/pins/count",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://feedbacks-api.wildberries.ru");

КонецФункции

// Лимиты закреплённых отзывов
//
// Метод возвращает лимиты закреплённых отзывов по тарифу и подписке.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для всех методов категории **Вопросы и отзывы**:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Сервисный | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Базовый с секретом | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Базовый | 1 ч | 5 запросов | 12 мин | 1 запрос |
//
// Library doc: https://valeryverkhoturov.github.io/wb-api-client-docs/reference/api/communications/get-api-feedbacks-v1-pins-limits
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1PinsLimits() Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/feedbacks/v1/pins/limits",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://feedbacks-api.wildberries.ru");

КонецФункции

// Получить вопрос по ID
//
// Метод возвращает данные [вопроса](https://dev.wildberries.ru/openapi/customer-communication#tag/questions/operation/getV1Questions) по его ID. Далее вы можете [работать с этим вопросом](https://dev.wildberries.ru/openapi/customer-communication#tag/questions/operation/patchV1Questions).
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для всех методов категории **Вопросы и отзывы**:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Сервисный | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Базовый с секретом | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Базовый | 1 ч | 5 запросов | 12 мин | 1 запрос |
//
// Library doc: https://valeryverkhoturov.github.io/wb-api-client-docs/reference/api/communications/get-api-v1-question
//
// Параметры:
//   id - Строка - ID вопроса
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1Question(Знач id) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("id", id);
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/v1/question",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://feedbacks-api.wildberries.ru");

КонецФункции

// Список вопросов
//
// Метод возвращает список вопросов по заданным фильтрам. Вы можете:
// - получить данные отвеченных и неотвеченных вопросов
// - сортировать вопросы по дате
// - настроить пагинацию и количество вопросов в ответе
//
// Можно получить максимум 10 000 вопросов в одном ответе
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для всех методов категории **Вопросы и отзывы**:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Сервисный | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Базовый с секретом | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Базовый | 1 ч | 5 запросов | 12 мин | 1 запрос |
//
// Library doc: https://valeryverkhoturov.github.io/wb-api-client-docs/reference/api/communications/get-api-v1-questions
//
// Параметры:
//   isAnswered - Булево - Есть ли ответ на вопрос: - `true` — да - `false` — нет
//   take - Число - Количество запрашиваемых вопросов (максимально допустимое значение для параметра - 10 000, при этом сумма значений параметров `take` и `skip` не должна превышат…
//   skip - Число - Количество вопросов для пропуска (максимально допустимое значение для параметра - 10 000, при этом сумма значений параметров `take` и `skip` не должна превышать…
//   ДопПараметры - Структура, Соответствие - необязательные параметры:
//    * nmId - Число - Артикул WB
//    * order - Строка - Сортировка вопросов по дате (`dateAsc`/`dateDesc`)
//    * dateFrom - Число - Дата начала периода в формате Unix timestamp
//    * dateTo - Число - Дата конца периода в формате Unix timestamp
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1Questions(Знач isAnswered, Знач take, Знач skip, Знач ДопПараметры = Неопределено) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("isAnswered", isAnswered);
	ПараметрыЗапроса.Вставить("take", take);
	ПараметрыЗапроса.Вставить("skip", skip);
	Заголовки = Новый Соответствие;

	ИменаЗаголовков = Новый Массив;
	Транспорт.РазложитьПараметры(ДопПараметры, ИменаЗаголовков, ПараметрыЗапроса, Заголовки);
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/v1/questions",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://feedbacks-api.wildberries.ru");

КонецФункции

// Количество вопросов
//
// Метод возвращает количество отвеченных или неотвеченных [вопросов](https://dev.wildberries.ru/openapi/customer-communication#tag/questions/operation/getV1Questions) за заданный период.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для всех методов категории **Вопросы и отзывы**:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Сервисный | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Базовый с секретом | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Базовый | 1 ч | 5 запросов | 12 мин | 1 запрос |
//
// Library doc: https://valeryverkhoturov.github.io/wb-api-client-docs/reference/api/communications/get-api-v1-questions-count
//
// Параметры:
//   ДопПараметры - Структура, Соответствие - необязательные параметры:
//    * dateFrom - Число - Дата начала периода в формате Unix timestamp
//    * dateTo - Число - Дата конца периода в формате Unix timestamp
//    * isAnswered - Булево - Есть ли ответ на вопрос: - `true` — да - `false` — нет
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1QuestionsCount(Знач ДопПараметры = Неопределено) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;

	ИменаЗаголовков = Новый Массив;
	Транспорт.РазложитьПараметры(ДопПараметры, ИменаЗаголовков, ПараметрыЗапроса, Заголовки);
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/v1/questions/count",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://feedbacks-api.wildberries.ru");

КонецФункции

// Неотвеченные вопросы
//
// Метод возвращает общее количество неотвеченных [вопросов](https://dev.wildberries.ru/openapi/customer-communication#tag/questions/operation/getV1Questions) и количество неотвеченных вопросов за сегодня.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для всех методов категории **Вопросы и отзывы**:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Сервисный | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Базовый с секретом | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Базовый | 1 ч | 5 запросов | 12 мин | 1 запрос |
//
// Library doc: https://valeryverkhoturov.github.io/wb-api-client-docs/reference/api/communications/get-api-v1-questions-count-unanswered
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1QuestionsCountUnanswered() Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/v1/questions/count-unanswered",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://feedbacks-api.wildberries.ru");

КонецФункции

// Список чатов
//
// Метод возвращает список всех чатов продавца. По этим данным можно получить [события чатов](https://dev.wildberries.ru/openapi/customer-communication#tag/buyersChat/operation/getV1SellerEvents) или [отправить сообщение покупателю](https://dev.wildberries.ru/openapi/customer-communication#tag/buyersChat/operation/postV1SellerMessage).
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 10 сек | 10 запросов | 1 сек | 10 запросов |
// | Сервисный | 10 сек | 10 запросов | 1 сек | 10 запросов |
// | Базовый с секретом | 10 сек | 10 запросов | 1 сек | 10 запросов |
// | Базовый | 1 ч | 1 запрос | 1 ч | 1 запрос |
//
// Library doc: https://valeryverkhoturov.github.io/wb-api-client-docs/reference/api/communications/get-api-v1-seller-chats
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1SellerChats() Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/v1/seller/chats",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://buyer-chat-api.wildberries.ru");

КонецФункции

// Получить файл из сообщения
//
// Метод возвращает файл или изображение из сообщения по его ID.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 10 сек | 10 запросов | 1 сек | 10 запросов |
// | Сервисный | 10 сек | 10 запросов | 1 сек | 10 запросов |
// | Базовый с секретом | 10 сек | 10 запросов | 1 сек | 10 запросов |
// | Базовый | 1 ч | 10 запросов | 6 мин | 1 запрос |
//
// Library doc: https://valeryverkhoturov.github.io/wb-api-client-docs/reference/api/communications/get-api-v1-seller-download-id
//
// Параметры:
//   id - Строка - ID файла, см. значение поля `downloadID` в методе [События чатов](./customer-communication#tag/buyersChat/operation/getV1SellerEvents)
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1SellerDownloadId(Знач id) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		СтрШаблон("/api/v1/seller/download/%1", Транспорт.ЭкранироватьСегмент(id)),
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://buyer-chat-api.wildberries.ru");

КонецФункции

// События чатов
//
// Метод возвращает список событий всех [чатов с покупателями](https://dev.wildberries.ru/openapi/customer-communication#tag/buyersChat/operation/getV1SellerChats).
// Чтобы получить все события:
// 1. Сделайте первый запрос без параметра `next`.
// 2. Повторяйте запрос со значением параметра `next` из ответа на предыдущий запрос, пока `totalEvents` не станет равным `0`. Это будет означать, что вы получили все события.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 10 сек | 10 запросов | 1 сек | 10 запросов |
// | Сервисный | 10 сек | 10 запросов | 1 сек | 10 запросов |
// | Базовый с секретом | 10 сек | 10 запросов | 1 сек | 10 запросов |
// | Базовый | 1 ч | 1 запрос | 1 ч | 1 запрос |
//
// Library doc: https://valeryverkhoturov.github.io/wb-api-client-docs/reference/api/communications/get-api-v1-seller-events
//
// Параметры:
//   ДопПараметры - Структура, Соответствие - необязательные параметры:
//    * next - Число - Пагинатор. С какого момента получить следующий пакет данных. Формат Unix timestamp \\*\\*с миллисекундами\\*\\*
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1SellerEvents(Знач ДопПараметры = Неопределено) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;

	ИменаЗаголовков = Новый Массив;
	Транспорт.РазложитьПараметры(ДопПараметры, ИменаЗаголовков, ПараметрыЗапроса, Заголовки);
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/v1/seller/events",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://buyer-chat-api.wildberries.ru");

КонецФункции

// Ответ на заявку покупателя
//
// Метод отправляет ответ на [заявку](https://dev.wildberries.ru/openapi/customer-communication#tag/buyersReturns/operation/getV1Claims) покупателя на возврат товаров.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 20 запросов | 3 сек | 10 запросов |
// | Сервисный | 1 мин | 20 запросов | 3 сек | 10 запросов |
// | Базовый с секретом | 1 мин | 20 запросов | 3 сек | 10 запросов |
// | Базовый | 1 ч | 1 запрос | 1 ч | 1 запрос |
//
// Library doc: https://valeryverkhoturov.github.io/wb-api-client-docs/reference/api/communications/patch-api-v1-claim
//
// Параметры:
//   Тело - CommunicationsPatchV1ClaimRequest - Ответ на заявку
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PatchV1Claim(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"PATCH",
		"/api/v1/claim",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://returns-api.wildberries.ru");

КонецФункции

// Отредактировать ответ на отзыв
//
// Метод позволяет отредактировать уже отправленный [ответ на отзыв](https://dev.wildberries.ru/openapi/customer-communication#tag/feedbacks/operation/postV1FeedbacksAnswer) покупателя.
//
// Отредактировать ответ можно только один раз в течение 60 дней c момента отправки.
//
// ID отзыва не валидируется. Если в запросе вы передали некорректный ID, вы не получите ошибку.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для всех методов категории **Вопросы и отзывы**:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Сервисный | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Базовый с секретом | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Базовый | 1 ч | 5 запросов | 12 мин | 1 запрос |
//
// Library doc: https://valeryverkhoturov.github.io/wb-api-client-docs/reference/api/communications/patch-api-v1-feedbacks-answer
//
// Параметры:
//   Тело - CommunicationsPatchV1FeedbacksAnswerRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PatchV1FeedbacksAnswer(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"PATCH",
		"/api/v1/feedbacks/answer",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://feedbacks-api.wildberries.ru");

КонецФункции

// Работа с вопросами
//
// В зависимости от тела запроса, метод позволяет:
// - отметить [вопрос](https://dev.wildberries.ru/openapi/customer-communication#tag/questions/operation/getV1Questions) как просмотренный
// - отклонить вопрос
// - ответить на вопрос или отредактировать ответ
//
// Все ответы продавцов проходят предварительную модерацию перед публикацией
//
// Отредактировать ответ на вопрос можно 1 раз в течение 60 дней после отправки ответа
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для всех методов категории **Вопросы и отзывы**:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Сервисный | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Базовый с секретом | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Базовый | 1 ч | 5 запросов | 12 мин | 1 запрос |
//
// Library doc: https://valeryverkhoturov.github.io/wb-api-client-docs/reference/api/communications/patch-api-v1-questions
//
// Параметры:
//   Тело - CommunicationsPatchV1QuestionsRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PatchV1Questions(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"PATCH",
		"/api/v1/questions",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://feedbacks-api.wildberries.ru");

КонецФункции

// Ответить на отзыв
//
// Метод позволяет ответить на [отзыв](https://dev.wildberries.ru/openapi/customer-communication#tag/feedbacks/operation/getV1Feedbacks) покупателя.
//
// ID отзыва не валидируется. Если в запросе вы передали некорректный ID, вы не получите ошибку.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для всех методов категории **Вопросы и отзывы**:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Сервисный | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Базовый с секретом | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Базовый | 1 ч | 5 запросов | 12 мин | 1 запрос |
//
// Library doc: https://valeryverkhoturov.github.io/wb-api-client-docs/reference/api/communications/post-api-v1-feedbacks-answer
//
// Параметры:
//   Тело - CommunicationsPostV1FeedbacksAnswerRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV1FeedbacksAnswer(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/api/v1/feedbacks/answer",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://feedbacks-api.wildberries.ru");

КонецФункции

// Возврат товара по ID отзыва
//
// Метод запрашивает возврат товара, по которому оставлен [отзыв](https://dev.wildberries.ru/openapi/customer-communication#tag/feedbacks/operation/getV1Feedbacks).
//
// Возврат доступен для отзывов с полем `\"isAbleReturnProductOrders\": true`.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для всех методов категории **Вопросы и отзывы**:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Сервисный | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Базовый с секретом | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Базовый | 1 ч | 5 запросов | 12 мин | 1 запрос |
//
// Library doc: https://valeryverkhoturov.github.io/wb-api-client-docs/reference/api/communications/post-api-v1-feedbacks-order-return
//
// Параметры:
//   Тело - CommunicationsPostV1FeedbacksOrderReturnRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV1FeedbacksOrderReturn(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/api/v1/feedbacks/order/return",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://feedbacks-api.wildberries.ru");

КонецФункции

// Закрепить отзывы
//
// Метод позволяет закрепить отзывы в карточке товара или в группе [объединённых](https://dev.wildberries.ru/knowledge-base/articles/019d49a4-1320-71bb-9dac-8ba07e7177ce/rabota-s-tovarami#obuedinenie-i-razuedinenie-kartochek-tovarov) карточек.
// Чтобы получить ID отзывов, используйте метод [Список закреплённых и откреплённых отзывов](https://dev.wildberries.ru/openapi/customer-communication#tag/pinnedFeedbacks/operation/getV1Pins).
//
// Метод доступен по [подписке Джем](https://seller.wildberries.ru/monetization/jam) или c [тарифной опцией](https://seller.wildberries.ru/tariff-constructor) \\*\\*Закрепление отзыва\\*\\*.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для всех методов категории **Вопросы и отзывы**:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Сервисный | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Базовый с секретом | 1 сек | 3 запроса | 333 мс | 6 запросов |
// | Базовый | 1 ч | 5 запросов | 12 мин | 1 запрос |
//
// Library doc: https://valeryverkhoturov.github.io/wb-api-client-docs/reference/api/communications/post-api-feedbacks-v1-pins
//
// Параметры:
//   Тело - Массив
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV1Pins(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/api/feedbacks/v1/pins",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://feedbacks-api.wildberries.ru");

КонецФункции

// Отправить сообщение
//
// Метод отправляет сообщения в [чат с покупателем](https://dev.wildberries.ru/openapi/customer-communication#tag/buyersChat/operation/getV1SellerChats).
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 10 сек | 10 запросов | 1 сек | 10 запросов |
// | Сервисный | 10 сек | 10 запросов | 1 сек | 10 запросов |
// | Базовый с секретом | 10 сек | 10 запросов | 1 сек | 10 запросов |
// | Базовый | 1 ч | 1 запрос | 1 ч | 1 запрос |
//
// Library doc: https://valeryverkhoturov.github.io/wb-api-client-docs/reference/api/communications/post-api-v1-seller-message
//
// Параметры:
//   replySign - Строка - Подпись чата. Можно получить из [информации по чату](./customer-communication#tag/buyersChat/operation/getV1SellerChats) или [данных события](./customer-communi…
//   ДопПараметры - Структура, Соответствие - необязательные параметры:
//    * message - Строка - Текст сообщения. Максимум 1000 символов.
//    * file - Массив - Файлы, формат JPEG, PDF или PNG, максимальный размер — 5 Мб каждый. Максимальный суммарный размер файлов — 30 Мб.
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV1SellerMessage(Знач replySign, Знач ДопПараметры = Неопределено) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;

	ИменаЗаголовков = Новый Массив;
	Транспорт.РазложитьПараметры(ДопПараметры, ИменаЗаголовков, ПараметрыЗапроса, Заголовки);
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/api/v1/seller/message",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://buyer-chat-api.wildberries.ru");

КонецФункции

