// PromotionApi
//
// Класс сформирован автоматически (onescript) из спецификации OpenAPI.
// Правки будут потеряны при следующей генерации.
//
// Пример:
//   Настройки = Новый Конфигурация();
//   Настройки.УстановитьТокен("...");
//   Клиент = Новый PromotionApi(Настройки);

Перем Настройки Экспорт;
Перем Транспорт Экспорт;

Процедура ПриСозданииОбъекта(Знач ВходящиеНастройки)
	Настройки = ВходящиеНастройки;
	Транспорт = Новый ТранспортHTTP(Настройки);
КонецПроцедуры

// Удалить ставки поисковых кластеров
//
// Метод удаляет ставки с поисковых кластеров.
// Можно использовать только для кампаний с:
// - ручной ставкой
// - моделью оплаты `cpm` — за показы
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 5 запросов | 200 мс | 10 запросов |
// | Сервисный | 1 сек | 5 запросов | 200 мс | 10 запросов |
// | Базовый с секретом | 1 сек | 5 запросов | 200 мс | 10 запросов |
// | Базовый | 1 ч | 5 запросов | 12 мин | 1 запрос |
//
// Параметры:
//   Тело - PromotionV0DeleteNormQueryBidsRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция DeleteV0NormqueryBids(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"DELETE",
		"/adv/v0/normquery/bids",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://advert-api.wildberries.ru");

КонецФункции

// Рекомендуемые ставки для карточек товаров и поисковых кластеров
//
// Метод возвращает рекомендуемые ставки для карточек товаров и поисковых кластеров кампании.
// Можно использовать для кампаний с типами оплаты `cpm` — за показы и `cpc` — за клики.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 5 запросов | 12 сек | 5 запросов |
// | Сервисный | 1 мин | 5 запросов | 12 сек | 5 запросов |
// | Базовый с секретом | 1 мин | 5 запросов | 12 сек | 5 запросов |
// | Базовый | 1 ч | 20 запросов | 3 мин | 1 запрос |
//
// Параметры:
//   nmId - Число - Артикул WB
//   advertId - Число - ID кампании
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV0BidsRecommendations(Знач nmId, Знач advertId) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("nmId", nmId);
	ПараметрыЗапроса.Вставить("advertId", advertId);
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/advert/v0/bids/recommendations",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://advert-api.wildberries.ru");

КонецФункции

// Получить настройки дневных лимитов кампаний
//
// Метод [доступен](https://dev.wildberries.ru/openapi/api-information#tag/authorization/Pravila-ispolzovaniya-tokenov-dostupa-k-API) по
// **Персональному** токену,
// **Сервисному** токену
//
// Метод возвращает текущие настройки [дневных лимитов кампаний CPC](https://cmp.wildberries.ru/campaigns/help/knowledge-base/options#%D0%94%D0%BD%D0%B5%D0%B2%D0%BD%D0%BE%D0%B9%D0%BB%D0%B8%D0%BC%D0%B8%D1%82%D0%B2%D0%BA%D0%B0%D0%BC%D0%BF%D0%B0%D0%BD%D0%B8%D1%8F%D1%85%D1%81%D0%BE%D0%BF%D0%BB%D0%B0%D1%82%D0%BE%D0%B9%D0%B7%D0%B0%D0%BA%D0%BB%D0%B8%D0%BA%D0%B8%D0%A1%D0%A0%D0%A1) — максимальных сумм, которые кампании могут потратить на продвижение в течение суток.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 5 запросов | 12 сек | 5 запросов |
// | Сервисный | 1 мин | 5 запросов | 12 сек | 5 запросов |
//
// Параметры:
//   advertIds - Строка - ID кампаний, максимум 100. Укажите значения через запятую
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV0DailyLimits(Знач advertIds) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("advertIds", advertIds);
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/advert/v0/daily-limits",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://advert-api.wildberries.ru");

КонецФункции

// Удаление кампании
//
// Метод удаляет [кампании](https://dev.wildberries.ru/openapi/promotion#tag/campaigns/operation/getV2Adverts) в статусе `4` — готова к запуску.
//
// После удаления кампания некоторое время будет находиться в статусе `-1` — кампания в процессе удаления. Полное удаление кампании занимает от 3 до 10 минут.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 5 запросов | 200 мс | 5 запросов |
// | Сервисный | 1 сек | 5 запросов | 200 мс | 5 запросов |
// | Базовый с секретом | 1 сек | 5 запросов | 200 мс | 5 запросов |
// | Базовый | 1 ч | 5 запросов | 12 мин | 1 запрос |
//
// Параметры:
//   id - Число - ID кампании
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV0Delete(Знач id) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("id", id);
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/adv/v0/delete",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://advert-api.wildberries.ru");

КонецФункции

// Пауза кампании
//
// Метод ставит [кампании](https://dev.wildberries.ru/openapi/promotion#tag/campaigns/operation/getV2Adverts) в статусе `9` — активна — на паузу.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 5 запросов | 200 мс | 5 запросов |
// | Сервисный | 1 сек | 5 запросов | 200 мс | 5 запросов |
// | Базовый с секретом | 1 сек | 5 запросов | 200 мс | 5 запросов |
// | Базовый | 1 ч | 5 запросов | 12 мин | 1 запрос |
//
// Параметры:
//   id - Число - ID кампании
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV0Pause(Знач id) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("id", id);
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/adv/v0/pause",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://advert-api.wildberries.ru");

КонецФункции

// Запуск кампании
//
// Метод запускает [кампании](https://dev.wildberries.ru/openapi/promotion#tag/campaigns/operation/getV2Adverts) в статусах `4` — готово к запуску — или `11` — пауза.
// Чтобы запустить кампанию, проверьте ее бюджет. Если бюджета недостаточно, [пополните его](https://dev.wildberries.ru/openapi/promotion#tag/finances/operation/postV1BudgetDeposit).
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 5 запросов | 200 мс | 5 запросов |
// | Сервисный | 1 сек | 5 запросов | 200 мс | 5 запросов |
// | Базовый с секретом | 1 сек | 5 запросов | 200 мс | 5 запросов |
// | Базовый | 1 ч | 5 запросов | 12 мин | 1 запрос |
//
// Параметры:
//   id - Число - ID кампании
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV0Start(Знач id) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("id", id);
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/adv/v0/start",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://advert-api.wildberries.ru");

КонецФункции

// Завершение кампании
//
// Метод завершает [кампании](https://dev.wildberries.ru/openapi/promotion#tag/campaigns/operation/getV2Adverts) в статусах:
// - `9` — активна
// - `11` — пауза
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 5 запросов | 200 мс | 5 запросов |
// | Сервисный | 1 сек | 5 запросов | 200 мс | 5 запросов |
// | Базовый с секретом | 1 сек | 5 запросов | 200 мс | 5 запросов |
// | Базовый | 1 ч | 5 запросов | 12 мин | 1 запрос |
//
// Параметры:
//   id - Число - ID кампании
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV0Stop(Знач id) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("id", id);
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/adv/v0/stop",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://advert-api.wildberries.ru");

КонецФункции

// Информация о медиакампании
//
// Метод возвращает информацию о кампании [WB Медиа](https://cmp.wildberries.ru/cmpf/list). Вместо карточек товаров в медиакампаниях продвигаются рекламные баннеры продавца на сайте и в приложении WB.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 10 запросов | 100 мс | 10 запросов |
// | Сервисный | 1 сек | 10 запросов | 100 мс | 10 запросов |
// | Базовый с секретом | 1 сек | 10 запросов | 100 мс | 10 запросов |
// | Базовый | 1 ч | 5 запросов | 12 мин | 1 запрос |
//
// Параметры:
//   id - Число - ID медиакампании
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1Advert(Знач id) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("id", id);
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/adv/v1/advert",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://advert-media-api.wildberries.ru");

КонецФункции

// Список медиакампаний
//
// Метод возвращает список всех [медиакампаний](https://dev.wildberries.ru/openapi/promotion#tag/media/operation/getV1Advert) продавца по их типам и статусам.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 10 запросов | 100 мс | 10 запросов |
// | Сервисный | 1 сек | 10 запросов | 100 мс | 10 запросов |
// | Базовый с секретом | 1 сек | 10 запросов | 100 мс | 10 запросов |
// | Базовый | 1 ч | 1 запрос | 1 ч | 1 запрос |
//
// Параметры:
//   ДопПараметры - Структура, Соответствие - необязательные параметры:
//    * status - Строка - Статус медиакампании: - `1` — черновик - `2` — модерация - `3` — отклонена (с возможностью вернуть на модерацию) - `4` — готова к запуску - `5` — запланирована…
//    * type - Число - Тип медиакампании: - `1` — размещение по дням - `2` — размещение по просмотрам
//    * limit - Число - Количество кампаний в ответе
//    * offset - Число - Смещение относительно первой медиакампании
//    * order - Строка - Порядок вывода ответа: - `create` — по времени создания медиакампании - `id` — по ID медиакампании
//    * direction - Строка - Порядок сортировки: - `desc` — от большего к меньшему - `asc` — от меньшего к большему
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1Adverts(Знач ДопПараметры = Неопределено) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;

	ИменаЗаголовков = Новый Массив;
	Транспорт.РазложитьПараметры(ДопПараметры, ИменаЗаголовков, ПараметрыЗапроса, Заголовки);
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/adv/v1/adverts",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://advert-media-api.wildberries.ru");

КонецФункции

// Баланс
//
// Метод возвращает информацию о:
// - счёте кабинета Продвижения WB. Его пополняет продавец.
// - балансе — максимальной сумме для оплаты кампании по взаиморасчету: удержании средств из будущих продаж. Баланс пополнить нельзя, он рассчитывается автоматически на основе отчётов по продвижению.
// - бонусных начислениях WB.
// Чтобы получить информацию о бюджетах кампаний, используйте метод [Бюджеты кампаний](https://dev.wildberries.ru/openapi/promotion#tag/finances/operation/postV2Budget).
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 1 запрос | 1 сек | 5 запросов |
// | Сервисный | 1 сек | 1 запрос | 1 сек | 5 запросов |
// | Базовый с секретом | 1 сек | 1 запрос | 1 сек | 5 запросов |
// | Базовый | 1 ч | 2 запроса | 30 мин | 1 запрос |
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1Balance() Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/adv/v1/balance",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://advert-api.wildberries.ru");

КонецФункции

// Бюджет кампании
//
// Метод будет отключен [16 ноября](https://dev.wildberries.ru/release-notes?id=582).
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 4 запроса | 250 мс | 4 запроса |
// | Сервисный | 1 сек | 4 запроса | 250 мс | 4 запроса |
// | Базовый с секретом | 1 сек | 4 запроса | 250 мс | 4 запроса |
// | Базовый | 1 ч | 4 запроса | 15 мин | 1 запрос |
//
// Параметры:
//   id - Число - ID кампании
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1Budget(Знач id) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("id", id);
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/adv/v1/budget",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://advert-api.wildberries.ru");

КонецФункции

// Список акций
//
// Метод возвращает список [акций](https://dev.wildberries.ru/openapi/promotion#tag/promoCalendar/operation/getV1CalendarPromotionsDetails) в WB с датами и временем проведения.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для всех методов категории **Календарь акций**:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 6 сек | 10 запросов | 600 мс | 5 запросов |
// | Сервисный | 6 сек | 10 запросов | 600 мс | 5 запросов |
// | Базовый с секретом | 6 сек | 10 запросов | 600 мс | 5 запросов |
// | Базовый | 1 ч | 1 запрос | 1 ч | 1 запрос |
//
// Параметры:
//   startDateTime - Строка - Начало периода, формат `YYYY-MM-DDTHH:MM:SSZ`
//   endDateTime - Строка - Конец периода, формат `YYYY-MM-DDTHH:MM:SSZ`
//   allPromo - Булево - Показать акции: - `false` — доступные для участия - `true` — все акции
//   ДопПараметры - Структура, Соответствие - необязательные параметры:
//    * limit - Число - Количество запрашиваемых акций
//    * offset - Число - После какого элемента выдавать данные
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1CalendarPromotions(Знач startDateTime, Знач endDateTime, Знач allPromo, Знач ДопПараметры = Неопределено) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("startDateTime", startDateTime);
	ПараметрыЗапроса.Вставить("endDateTime", endDateTime);
	ПараметрыЗапроса.Вставить("allPromo", allPromo);
	Заголовки = Новый Соответствие;

	ИменаЗаголовков = Новый Массив;
	Транспорт.РазложитьПараметры(ДопПараметры, ИменаЗаголовков, ПараметрыЗапроса, Заголовки);
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/v1/calendar/promotions",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://dp-calendar-api.wildberries.ru");

КонецФункции

// Детальная информация об акциях
//
// Метод возвращает подробную информацию об [акции](https://dev.wildberries.ru/openapi/promotion#tag/promoCalendar/operation/getV1CalendarPromotionsDetails) по ID.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для всех методов категории **Календарь акций**:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 6 сек | 10 запросов | 600 мс | 5 запросов |
// | Сервисный | 6 сек | 10 запросов | 600 мс | 5 запросов |
// | Базовый с секретом | 6 сек | 10 запросов | 600 мс | 5 запросов |
// | Базовый | 1 ч | 1 запрос | 1 ч | 1 запрос |
//
// Параметры:
//   promotionIDs - Массив - ID акций, по которым нужно вернуть информацию
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1CalendarPromotionsDetails(Знач promotionIDs) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("promotionIDs", promotionIDs);
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/v1/calendar/promotions/details",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://dp-calendar-api.wildberries.ru");

КонецФункции

// Список товаров для участия в акции
//
// Метод формирует список товаров, подходящих для участия в [акции](https://dev.wildberries.ru/openapi/promotion#tag/promoCalendar/operation/getV1CalendarPromotionsDetails). Эти товары можно добавить в акцию с помощью [отдельного метода](https://dev.wildberries.ru/openapi/promotion#tag/promoCalendar/operation/postV1CalendarPromotionsUpload).
//
// Данный метод неприменим для автоакций.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для всех методов категории **Календарь акций**:
// | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- |
// | 6 сек | 10 запросов | 600 мс | 5 запросов |
//
// Параметры:
//   promotionID - Число - ID акции
//   inAction - Булево - Участвует в акции: - `true` — да - `false` — нет
//   ДопПараметры - Структура, Соответствие - необязательные параметры:
//    * limit - Число - Количество запрашиваемых товаров
//    * offset - Число - После какого элемента выдавать данные
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1CalendarPromotionsNomenclatures(Знач promotionID, Знач inAction, Знач ДопПараметры = Неопределено) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("promotionID", promotionID);
	ПараметрыЗапроса.Вставить("inAction", inAction);
	Заголовки = Новый Соответствие;

	ИменаЗаголовков = Новый Массив;
	Транспорт.РазложитьПараметры(ДопПараметры, ИменаЗаголовков, ПараметрыЗапроса, Заголовки);
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/v1/calendar/promotions/nomenclatures",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://dp-calendar-api.wildberries.ru");

КонецФункции

// Конфигурационные значения продвижения
//
// Метод возвращает валюту, код валюты [аккаунта продавца](https://cmp.wildberries.ru/campaigns/finances) и допустимые шаги ставок для метода [POST /api/advert/v1/normquery/bids](https://dev.wildberries.ru/openapi/promotion#tag/searchClusters/operation/postV1NormqueryBids)
//
// Метод [доступен](https://dev.wildberries.ru/openapi/api-information#tag/authorization/Pravila-ispolzovaniya-tokenov-dostupa-k-API) по
// **Персональному** токену,
// **Сервисному** токену
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- |
// | 1 мин | 1 запрос | 1 мин | 10 запросов |
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1Config() Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/advert/v1/config",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://advert-api.wildberries.ru");

КонецФункции

// Количество медиакампаний
//
// Метод возвращает количество [медиакампаний](https://dev.wildberries.ru/openapi/promotion#tag/media/operation/getV1Advert) продавца с группировкой по статусам.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 10 запросов | 100 мс | 10 запросов |
// | Сервисный | 1 сек | 10 запросов | 100 мс | 10 запросов |
// | Базовый с секретом | 1 сек | 10 запросов | 100 мс | 10 запросов |
// | Базовый | 1 ч | 1 запрос | 1 ч | 1 запрос |
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1Count() Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/adv/v1/count",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://advert-media-api.wildberries.ru");

КонецФункции

// Получение истории пополнений счёта
//
// Метод возвращает историю пополнений счёта \\*\\*WB Продвижение\\*\\* за заданный период.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 1 запрос | 1 сек | 5 запросов |
// | Сервисный | 1 сек | 1 запрос | 1 сек | 5 запросов |
// | Базовый с секретом | 1 сек | 1 запрос | 1 сек | 5 запросов |
// | Базовый | 1 ч | 1 запрос | 1 ч | 1 запрос |
//
// Параметры:
//   ДопПараметры - Структура, Соответствие - необязательные параметры:
//    * from - Строка - Начало интервала
//    * to - Строка - Конец интервала. (Минимальный интервал 1 день, максимальный 31)
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1Payments(Знач ДопПараметры = Неопределено) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;

	ИменаЗаголовков = Новый Массив;
	Транспорт.РазложитьПараметры(ДопПараметры, ИменаЗаголовков, ПараметрыЗапроса, Заголовки);
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/adv/v1/payments",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://advert-api.wildberries.ru");

КонецФункции

// Списки кампаний
//
// Метод возвращает списки всех [рекламных кампаний](https://dev.wildberries.ru/openapi/promotion#tag/campaigns/operation/getV2Adverts) продавца с их ID. Кампании сгруппированы по типу и статусу, у каждой указана дата последнего изменения.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 5 запросов | 200 мс | 5 запросов |
// | Сервисный | 1 сек | 5 запросов | 200 мс | 5 запросов |
// | Базовый с секретом | 1 сек | 5 запросов | 200 мс | 5 запросов |
// | Базовый | 1 ч | 4 запроса | 15 мин | 1 запрос |
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1PromotionCount() Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/adv/v1/promotion/count",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://advert-api.wildberries.ru");

КонецФункции

// Предметы для кампаний
//
// Метод возвращает список [предметов](https://dev.wildberries.ru/openapi/item-management#tag/categoriesSubcategoriesAndCharacteristics/operation/getV2ObjectAll), которые можно добавить в рекламную [кампанию](https://dev.wildberries.ru/openapi/promotion#tag/campaigns/operation/getV2Adverts).
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 12 сек | 1 запрос | 12 сек | 5 запросов |
// | Сервисный | 12 сек | 1 запрос | 12 сек | 5 запросов |
// | Базовый с секретом | 12 сек | 1 запрос | 12 сек | 5 запросов |
// | Базовый | 1 ч | 2 запроса | 30 мин | 1 запрос |
//
// Параметры:
//   ДопПараметры - Структура, Соответствие - необязательные параметры:
//    * payment_type - Строка - Тип оплаты: - `cpm` — за показы - `cpc` — за клик
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1SupplierSubjects(Знач ДопПараметры = Неопределено) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;

	ИменаЗаголовков = Новый Массив;
	Транспорт.РазложитьПараметры(ДопПараметры, ИменаЗаголовков, ПараметрыЗапроса, Заголовки);
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/adv/v1/supplier/subjects",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://advert-api.wildberries.ru");

КонецФункции

// Получение истории затрат
//
// Метод формирует список фактических затрат на рекламные кампании за заданный период.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 1 запрос | 1 сек | 5 запросов |
// | Сервисный | 1 сек | 1 запрос | 1 сек | 5 запросов |
// | Базовый с секретом | 1 сек | 1 запрос | 1 сек | 5 запросов |
// | Базовый | 1 ч | 1 запрос | 1 ч | 1 запрос |
//
// Параметры:
//   from - Строка - Начало интервала
//   _to - Строка - Конец интервала. (Минимальный интервал 1 день, максимальный 31)
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1Upd(Знач from, Знач _to) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("from", from);
	ПараметрыЗапроса.Вставить("to", _to);
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/adv/v1/upd",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://advert-api.wildberries.ru");

КонецФункции

// Информация о кампаниях
//
// Метод возвращает информацию о рекламных кампаниях с единой или ручной ставкой по их статусам, типам оплаты и ID.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 5 запросов | 200 мс | 5 запросов |
// | Сервисный | 1 сек | 5 запросов | 200 мс | 5 запросов |
// | Базовый с секретом | 1 сек | 5 запросов | 200 мс | 5 запросов |
// | Базовый | 1 ч | 1 запрос | 1 ч | 1 запрос |
//
// Параметры:
//   ДопПараметры - Структура, Соответствие - необязательные параметры:
//    * ids - Строка - ID кампаний, максимум 50
//    * statuses - Строка - Статусы кампаний: - `-1` — удалена, процесс удаления будет завершён в течение 10 минут - `4` — готова к запуску - `7` — завершена - `8` — отменена - `9` — актив…
//    * payment_type - Строка - Тип оплаты: - `cpm` — за показы - `cpc` — за клик
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV2Adverts(Знач ДопПараметры = Неопределено) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;

	ИменаЗаголовков = Новый Массив;
	Транспорт.РазложитьПараметры(ДопПараметры, ИменаЗаголовков, ПараметрыЗапроса, Заголовки);
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/advert/v2/adverts",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://advert-api.wildberries.ru");

КонецФункции

// Статистика кампаний
//
// Метод формирует статистику для кампаний независимо от типа.
//
// Максимальный период в запросе — 31 день.
//
// Для кампаний в статусах `7`, `9` и `11`.
//
// В песочнице статистика кампаний доступна за последние 30 дней. Генерируется только для компаний в статусе `9`, тип `8`, 9 раз в сутки
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 3 запроса | 20 сек | 1 запрос |
// | Сервисный | 1 мин | 3 запроса | 20 сек | 1 запрос |
// | Базовый с секретом | 1 мин | 3 запроса | 20 сек | 1 запрос |
// | Базовый | 1 ч | 1 запрос | 1 ч | 1 запрос |
//
// Параметры:
//   ids - Строка - ID кампаний, максимум 50 значений
//   beginDate - Строка - Дата начала интервала
//   endDate - Строка - Дата окончания интервала
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV3Fullstats(Знач ids, Знач beginDate, Знач endDate) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("ids", ids);
	ПараметрыЗапроса.Вставить("beginDate", beginDate);
	ПараметрыЗапроса.Вставить("endDate", endDate);
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/adv/v3/fullstats",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://advert-api.wildberries.ru");

КонецФункции

// Изменение списка карточек товаров в кампаниях
//
// Метод добавляет и удаляет карточки товаров в кампаниях.
//
// Для кампаний в статусах `4`, `9` и `11`.
//
// Для добавляемых товаров устанавливается текущая минимальная ставка.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 1 запрос | 1 сек | 1 запрос |
// | Сервисный | 1 сек | 1 запрос | 1 сек | 1 запрос |
// | Базовый с секретом | 1 сек | 1 запрос | 1 сек | 1 запрос |
// | Базовый | 1 ч | 2 запроса | 30 мин | 1 запрос |
//
// Параметры:
//   Тело - PromotionPatchV0AuctionNmsRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PatchV0AuctionNms(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"PATCH",
		"/adv/v0/auction/nms",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://advert-api.wildberries.ru");

КонецФункции

// Изменение ставок в кампаниях
//
// Метод меняет ставки карточек товаров по артикулам WB в кампаниях:
// - с единой ставкой
// - с ручной ставкой
// - с моделью оплаты `cpc` — за клики
// Для кампаний в статусах `4`, `9` и `11`.
//
// В запросе укажите место размещения в параметре `placement`:
// - `combined` — в поиске и рекомендациях для кампаний с единой ставкой
// - `search `или `recommendations` — в поиске или рекомендациях для кампаний с ручной ставкой
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 5 запросов | 200 мс | 5 запросов |
// | Сервисный | 1 сек | 5 запросов | 200 мс | 5 запросов |
// | Базовый с секретом | 1 сек | 5 запросов | 200 мс | 5 запросов |
// | Базовый | 1 ч | 2 запроса | 30 мин | 1 запрос |
//
// Параметры:
//   Тело - PromotionPatchV1BidsRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PatchV1Bids(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"PATCH",
		"/api/advert/v1/bids",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://advert-api.wildberries.ru");

КонецФункции

// Установить ставки для поисковых кластеров
//
// Метод устанавливает ставки в рублях на поисковые кластеры.
// Можно использовать только для кампаний с:
// - ручной ставкой
// - моделью оплаты `cpm` — за показы
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 2 запроса | 500 мс | 4 запроса |
// | Сервисный | 1 сек | 2 запроса | 500 мс | 4 запроса |
// | Базовый с секретом | 1 сек | 2 запроса | 500 мс | 4 запроса |
// | Базовый | 1 ч | 5 запросов | 12 мин | 1 запрос |
//
// Параметры:
//   Тело - PromotionV0SetNormQueryBidsRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV0NormqueryBids(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/adv/v0/normquery/bids",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://advert-api.wildberries.ru");

КонецФункции

// Список ставок поисковых кластеров
//
// Метод возвращает список поисковых кластеров со ставками по:
// - ID кампаний
// - артикулам WB
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 5 запросов | 200 мс | 10 запросов |
// | Сервисный | 1 сек | 5 запросов | 200 мс | 10 запросов |
// | Базовый с секретом | 1 сек | 5 запросов | 200 мс | 10 запросов |
// | Базовый | 1 ч | 5 запросов | 12 мин | 1 запрос |
//
// Параметры:
//   Тело - PromotionV0GetNormQueryBidsRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV0NormqueryGetBids(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/adv/v0/normquery/get-bids",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://advert-api.wildberries.ru");

КонецФункции

// Список минус-фраз кампаний
//
// Метод возвращает список минус-фраз по:
// - ID кампаний
// - артикулам WB
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 5 запросов | 200 мс | 10 запросов |
// | Сервисный | 1 сек | 5 запросов | 200 мс | 10 запросов |
// | Базовый с секретом | 1 сек | 5 запросов | 200 мс | 10 запросов |
// | Базовый | 1 ч | 5 запросов | 12 мин | 1 запрос |
//
// Параметры:
//   Тело - PromotionV0GetNormQueryMinusRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV0NormqueryGetMinus(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/adv/v0/normquery/get-minus",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://advert-api.wildberries.ru");

КонецФункции

// Списки активных и неактивных поисковых кластеров
//
// Метод возвращает списки активных и неактивных поисковых кластеров, по которым было не меньше 100 показов.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 5 запросов | 200 мс | 10 запросов |
// | Сервисный | 1 сек | 5 запросов | 200 мс | 10 запросов |
// | Базовый с секретом | 1 сек | 5 запросов | 200 мс | 10 запросов |
// | Базовый | 1 ч | 5 запросов | 12 мин | 1 запрос |
//
// Параметры:
//   Тело - PromotionV0GetNormQueryListRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV0NormqueryList(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/adv/v0/normquery/list",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://advert-api.wildberries.ru");

КонецФункции

// Установка и удаление минус-фраз
//
// Метод устанавливает и удаляет минус-фразы в кампаниях c единой и ручной ставкой.
//
// Отправка пустого массива удаляет все минус-фразы
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 5 запросов | 200 мс | 10 запросов |
// | Сервисный | 1 сек | 5 запросов | 200 мс | 10 запросов |
// | Базовый с секретом | 1 сек | 5 запросов | 200 мс | 10 запросов |
// | Базовый | 1 ч | 5 запросов | 12 мин | 1 запрос |
//
// Параметры:
//   Тело - PromotionV0SetMinusNormQueryRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV0NormquerySetMinus(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/adv/v0/normquery/set-minus",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://advert-api.wildberries.ru");

КонецФункции

// Статистика поисковых кластеров
//
// Метод формирует статистику по поисковым кластерам за указанный период.
// Можно использовать для кампаний с моделями оплаты `cpm` — за показы и `cpc` — за клики.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 10 запросов | 6 сек | 20 запросов |
// | Сервисный | 1 мин | 10 запросов | 6 сек | 20 запросов |
// | Базовый с секретом | 1 мин | 10 запросов | 6 сек | 20 запросов |
// | Базовый | 1 ч | 5 запросов | 12 мин | 1 запрос |
//
// Параметры:
//   Тело - PromotionV0GetNormQueryStatsRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV0NormqueryStats(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/adv/v0/normquery/stats",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://advert-api.wildberries.ru");

КонецФункции

// Переименование кампании
//
// Метод меняет название [кампании](https://dev.wildberries.ru/openapi/promotion#tag/campaigns/operation/getV2Adverts). Это можно сделать в любой момент существования кампании.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 5 запросов | 200 мс | 5 запросов |
// | Сервисный | 1 сек | 5 запросов | 200 мс | 5 запросов |
// | Базовый с секретом | 1 сек | 5 запросов | 200 мс | 5 запросов |
// | Базовый | 1 ч | 2 запроса | 30 мин | 1 запрос |
//
// Параметры:
//   Тело - PromotionPostV0RenameRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV0Rename(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/adv/v0/rename",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://advert-api.wildberries.ru");

КонецФункции

// Минимальные ставки для карточек товаров
//
// Метод возвращает минимальные ставки для карточек товаров в разменных единицах — 0,01 от базовой валюты [аккаунта продавца](https://cmp.wildberries.ru/campaigns/finances) — по типу оплаты и местам размещения.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 20 запросов | 3 сек | 5 запросов |
// | Сервисный | 1 мин | 20 запросов | 3 сек | 5 запросов |
// | Базовый с секретом | 1 мин | 20 запросов | 3 сек | 5 запросов |
// | Базовый | 1 ч | 5 запросов | 12 мин | 1 запрос |
//
// Параметры:
//   Тело - PromotionPostV1BidsMinRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV1BidsMin(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/api/advert/v1/bids/min",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://advert-api.wildberries.ru");

КонецФункции

// Пополнение бюджета кампании
//
// Метод пополняет [бюджет](https://dev.wildberries.ru/openapi/promotion#tag/finances/operation/postV2Budget) кампании.
// Чтобы запустить кампанию после пополнения бюджета, используйте метод [Запуск кампании](https://dev.wildberries.ru/openapi/promotion#tag/campaignManagement/operation/getV0Start).
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 1 запрос | 1 сек | 5 запросов |
// | Сервисный | 1 сек | 1 запрос | 1 сек | 5 запросов |
// | Базовый с секретом | 1 сек | 1 запрос | 1 сек | 5 запросов |
// | Базовый | 1 ч | 5 запросов | 12 мин | 1 запрос |
//
// Параметры:
//   id - Число - ID кампании
//   Тело - PromotionPostV1BudgetDepositRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV1BudgetDeposit(Знач id, Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("id", id);
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/adv/v1/budget/deposit",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://advert-api.wildberries.ru");

КонецФункции

// Добавить товар в акцию
//
// Метод создаёт задание на загрузку товара в [акцию](https://dev.wildberries.ru/openapi/promotion#tag/promoCalendar/operation/getV1CalendarPromotionsDetails).
// Состояние загрузки можно проверить с помощью [отдельных методов](https://dev.wildberries.ru/openapi/item-management#tag/pricesAndDiscounts/operation/getV2HistoryTasks).
//
// Данный метод неприменим для автоакций.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца для всех методов категории **Календарь акций**:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 6 сек | 10 запросов | 600 мс | 5 запросов |
// | Сервисный | 6 сек | 10 запросов | 600 мс | 5 запросов |
// | Базовый с секретом | 6 сек | 10 запросов | 600 мс | 5 запросов |
// | Базовый | 1 ч | 1 запрос | 1 ч | 1 запрос |
//
// Параметры:
//   Тело - PromotionPostV1CalendarPromotionsUploadRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV1CalendarPromotionsUpload(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/api/v1/calendar/promotions/upload",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://dp-calendar-api.wildberries.ru");

КонецФункции

// Установить ставки для поисковых кластеров в валюте аккаунта продавца
//
// Метод [доступен](https://dev.wildberries.ru/openapi/api-information#tag/authorization/Pravila-ispolzovaniya-tokenov-dostupa-k-API) по
// **Персональному** токену,
// **Сервисному** токену
//
// Метод устанавливает ставки на поисковые кластеры в валюте [аккаунта продавца](https://cmp.wildberries.ru/campaigns/finances).
// Можно использовать только для кампаний c ручной ставкой и моделью оплаты `cpm` — за показы.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 2 запроса | 500 мс | 4 запроса |
// | Сервисный | 1 сек | 2 запроса | 500 мс | 4 запроса |
//
// Параметры:
//   Тело - PromotionV1SetNormQueryBidsRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV1NormqueryBids(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/api/advert/v1/normquery/bids",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://advert-api.wildberries.ru");

КонецФункции

// Статистика по поисковым кластерам с детализацией по дням
//
// Метод формирует статистику по поисковым кластерам за указанный период с детализацией по дням.
// Можно использовать для кампаний с моделями оплаты `cpm` — за показы и `cpc` — за клики.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 10 запросов | 6 сек | 20 запросов |
// | Сервисный | 1 мин | 10 запросов | 6 сек | 20 запросов |
// | Базовый с секретом | 1 мин | 10 запросов | 6 сек | 20 запросов |
// | Базовый | 1 ч | 2 запроса | 30 мин | 1 запрос |
//
// Параметры:
//   Тело - PromotionV1GetNormQueryStatsRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV1NormqueryStats(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/adv/v1/normquery/stats",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://advert-api.wildberries.ru");

КонецФункции

// Статистика медиакампаний
//
// Метод формирует статистику кампаний сервиса [WB Медиа](https://cmp.wildberries.ru/cmpf/statistics). Статистику можно группировать по датам и/или интервалам.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 10 запросов | 100 мс | 10 запросов |
// | Сервисный | 1 сек | 10 запросов | 100 мс | 10 запросов |
// | Базовый с секретом | 1 сек | 10 запросов | 100 мс | 10 запросов |
// | Базовый | 1 ч | 1 запрос | 1 ч | 1 запрос |
//
// Параметры:
//   Тело - Массив
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV1Stats(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/adv/v1/stats",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://advert-media-api.wildberries.ru");

КонецФункции

// Остатки бюджетов кампаний
//
// Метод возвращает информацию об остатках бюджетов [кампаний](https://dev.wildberries.ru/openapi/promotion#tag/campaigns/operation/getV2Adverts).
// Для кампаний в [статусах](https://dev.wildberries.ru/openapi/promotion#tag/campaigns/operation/getV1PromotionCount):
// - `4` — готова к запуску
// - `9` — активна
// - `11` — на паузе
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 20 запросов | 3 сек | 4 запроса |
// | Сервисный | 1 мин | 20 запросов | 3 сек | 4 запроса |
// | Базовый с секретом | 1 мин | 20 запросов | 3 сек | 4 запроса |
// | Базовый | 1 ч | 4 запроса | 15 мин | 1 запрос |
//
// Параметры:
//   Тело - PromotionV2BudgetRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV2Budget(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/api/advert/v2/budget",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://advert-api.wildberries.ru");

КонецФункции

// Создать кампанию
//
// Метод создаёт кампанию:
// - с ручной ставкой для продвижения товаров в поиске и/или рекомендациях
// - с единой ставкой для продвижения товаров одновременно в поиске и рекомендациях
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 5 запросов | 12 сек | 5 запросов |
// | Сервисный | 1 мин | 5 запросов | 12 сек | 5 запросов |
// | Базовый с секретом | 1 мин | 5 запросов | 12 сек | 5 запросов |
// | Базовый | 1 ч | 5 запросов | 12 мин | 1 запрос |
//
// Параметры:
//   Тело - PromotionPostV2SeacatSaveAdRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV2SeacatSaveAd(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/adv/v2/seacat/save-ad",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://advert-api.wildberries.ru");

КонецФункции

// Карточки товаров для кампаний
//
// Метод возвращает список [карточек товаров](https://dev.wildberries.ru/openapi/item-management#tag/listings/operation/postV2GetCardsList), которые можно добавить в рекламную [кампанию](https://dev.wildberries.ru/openapi/promotion#tag/campaigns/operation/getV2Adverts). Для получения карточек необходимы ID [предметов](https://dev.wildberries.ru/openapi/promotion#tag/creatingCampaigns/operation/getV1SupplierSubjects), также доступных для добавления в кампанию.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 5 запросов | 12 сек | 5 запросов |
// | Сервисный | 1 мин | 5 запросов | 12 сек | 5 запросов |
// | Базовый с секретом | 1 мин | 5 запросов | 12 сек | 5 запросов |
// | Базовый | 1 ч | 2 запроса | 30 мин | 1 запрос |
//
// Параметры:
//   Тело - Массив - ID предметов, для которых нужно получить карточки товаров
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV2SupplierNms(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/adv/v2/supplier/nms",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://advert-api.wildberries.ru");

КонецФункции

// Изменение мест размещения в кампаниях с ручной ставкой
//
// Метод меняет места размещения в кампаниях с ручной ставкой и моделью оплаты за показы — `cpm`.
//
// Для кампаний в статусах `4`, `9` и `11`.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 сек | 1 запрос | 1 сек | 1 запрос |
// | Сервисный | 1 сек | 1 запрос | 1 сек | 1 запрос |
// | Базовый с секретом | 1 сек | 1 запрос | 1 сек | 1 запрос |
// | Базовый | 1 ч | 2 запроса | 30 мин | 1 запрос |
//
// Параметры:
//   Тело - PromotionPutV0AuctionPlacementsRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PutV0AuctionPlacements(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"PUT",
		"/adv/v0/auction/placements",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://advert-api.wildberries.ru");

КонецФункции

// Настройка дневных лимитов кампаний
//
// Метод [доступен](https://dev.wildberries.ru/openapi/api-information#tag/authorization/Pravila-ispolzovaniya-tokenov-dostupa-k-API) по
// **Персональному** токену,
// **Сервисному** токену
//
// Метод включает, выключает и обновляет дневной лимит кампаний.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 5 запросов | 12 сек | 5 запросов |
// | Сервисный | 1 мин | 5 запросов | 12 сек | 5 запросов |
//
// Параметры:
//   Тело - PromotionV0PutDailyLimitsRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PutV0DailyLimits(Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"PUT",
		"/api/advert/v0/daily-limits",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://advert-api.wildberries.ru");

КонецФункции

