// RatesApi
//
// Класс сформирован автоматически (onescript) из спецификации OpenAPI.
// Правки будут потеряны при следующей генерации.
//
// Пример:
//   Настройки = Новый Конфигурация();
//   Настройки.УстановитьТокен("...");
//   Клиент = Новый RatesApi(Настройки);

Перем Настройки Экспорт;
Перем Транспорт Экспорт;

Процедура ПриСозданииОбъекта(Знач ВходящиеНастройки)
	Настройки = ВходящиеНастройки;
	Транспорт = Новый ТранспортHTTP(Настройки);
КонецПроцедуры

// Тарифы на поставку
//
// Метод [временно отключён](https://dev.wildberries.ru/release-notes?id=570)
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 6 запросов | 10 сек | 6 запросов |
// | Сервисный | 1 мин | 6 запросов | 10 сек | 6 запросов |
// | Базовый с секретом | 1 мин | 6 запросов | 10 сек | 6 запросов |
// | Базовый | 1 ч | 1 запрос | 1 ч | 1 запрос |
//
// Параметры:
//   ДопПараметры - Структура, Соответствие - необязательные параметры:
//    * warehouseIDs - Строка - ID складов. По умолчанию возвращаются данные по всем складам
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1AcceptanceCoefficients(Знач ДопПараметры = Неопределено) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;

	ИменаЗаголовков = Новый Массив;
	Транспорт.РазложитьПараметры(ДопПараметры, ИменаЗаголовков, ПараметрыЗапроса, Заголовки);
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/tariffs/v1/acceptance/coefficients",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://common-api.wildberries.ru");

КонецФункции

// Тарифы для коробов
//
// Для остатков товаров, которые поставляются на склад в коробах, метод возвращает [тарифы](https://seller.wildberries.ru/dynamic-product-categories) на:
// - доставку со склада или пункта приёма до покупателя
// - доставку от покупателя до пункта приёма
// - хранение на складе WB
//
// Тарифы для коробов совпадают с тарифами для **Суперсейфа**
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 60 запросов | 1 сек | 5 запросов |
// | Сервисный | 1 мин | 60 запросов | 1 сек | 5 запросов |
// | Базовый с секретом | 1 мин | 60 запросов | 1 сек | 5 запросов |
// | Базовый | 1 ч | 1 запрос | 1 ч | 1 запрос |
//
// Параметры:
//   date - Строка - Дата в формате ГГГГ-ММ-ДД
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1TariffsBox(Знач date) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("date", date);
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/v1/tariffs/box",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://common-api.wildberries.ru");

КонецФункции

// Комиссия по категориям товаров
//
// Метод возвращает данные о [комиссии](https://seller.wildberries.ru/dynamic-product-categories/commission) WB по [родительским категориям товаров](https://dev.wildberries.ru/openapi/item-management#tag/categoriesSubcategoriesAndCharacteristics/operation/getV2ObjectParentAll) согласно модели продаж.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 1 запрос | 1 мин | 2 запроса |
// | Сервисный | 1 мин | 1 запрос | 1 мин | 2 запроса |
// | Базовый с секретом | 1 мин | 1 запрос | 1 мин | 2 запроса |
// | Базовый | 1 ч | 5 запросов | 12 мин | 1 запрос |
//
// Параметры:
//   ДопПараметры - Структура, Соответствие - необязательные параметры:
//    * locale - Строка - Язык полей ответа `parentName` и `subjectName`: - `ru` — русский - `en` — английский - `zh` — китайский
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1TariffsCommission(Знач ДопПараметры = Неопределено) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;

	ИменаЗаголовков = Новый Массив;
	Транспорт.РазложитьПараметры(ДопПараметры, ИменаЗаголовков, ПараметрыЗапроса, Заголовки);
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/v1/tariffs/commission",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://common-api.wildberries.ru");

КонецФункции

// Тарифы для монопаллет
//
// Для товаров, которые поставляются на склад WB на монопаллетах, метод возвращает [стоимость](https://seller.wildberries.ru/dynamic-product-categories):
// - доставки со склада до покупателя
// - доставки от покупателя до склада
// - хранения на складе WB
//
// Тарифы для монопаллет совпадают с тарифами для **Поштучных паллет**
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 60 запросов | 1 сек | 5 запросов |
// | Сервисный | 1 мин | 60 запросов | 1 сек | 5 запросов |
// | Базовый с секретом | 1 мин | 60 запросов | 1 сек | 5 запросов |
// | Базовый | 1 ч | 1 запрос | 1 ч | 1 запрос |
//
// Параметры:
//   date - Строка - Дата в формате ГГГГ-ММ-ДД
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1TariffsPallet(Знач date) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("date", date);
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/v1/tariffs/pallet",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://common-api.wildberries.ru");

КонецФункции

// Тарифы на возврат
//
// Метод возвращает [тарифы](https://seller.wildberries.ru/dynamic-product-categories/return-cost):
// - на перевозку товаров со склада WB или из пункта приёма до продавца
// - на обратную перевозку возвратов, которые не забрал продавец
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 60 запросов | 1 сек | 5 запросов |
// | Сервисный | 1 мин | 60 запросов | 1 сек | 5 запросов |
// | Базовый с секретом | 1 мин | 60 запросов | 1 сек | 5 запросов |
// | Базовый | 1 ч | 1 запрос | 1 ч | 1 запрос |
//
// Параметры:
//   date - Строка - Дата в формате ГГГГ-ММ-ДД
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1TariffsReturn(Знач date) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("date", date);
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/v1/tariffs/return",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://common-api.wildberries.ru");

КонецФункции

