// OrdersFbwApi
//
// Класс сформирован автоматически (onescript) из спецификации OpenAPI.
// Правки будут потеряны при следующей генерации.
//
// Пример:
//   Настройки = Новый Конфигурация();
//   Настройки.УстановитьТокен("...");
//   Клиент = Новый OrdersFbwApi(Настройки);

Перем Настройки Экспорт;
Перем Транспорт Экспорт;

Процедура ПриСозданииОбъекта(Знач ВходящиеНастройки)
	Настройки = ВходящиеНастройки;
	Транспорт = Новый ТранспортHTTP(Настройки);
КонецПроцедуры

// Удалить черновик
//
// Метод [доступен](https://dev.wildberries.ru/openapi/api-information#tag/authorization/Pravila-ispolzovaniya-tokenov-dostupa-k-API) по
// **Персональному** токену,
// **Сервисному** токену
//
// Метод удаляет черновик поставки по его ID.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- |
// | 1 мин | 30 запросов | 2 сек | 10 запросов |
//
// Параметры:
//   draftId - Строка - ID черновика
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция DeleteV1DraftsDraftId(Знач draftId) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"DELETE",
		СтрШаблон("/api/supplies/v1/drafts/%1", Транспорт.ЭкранироватьСегмент(draftId)),
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://supplies-api.wildberries.ru");

КонецФункции

// Удалить товары из черновика
//
// Метод [доступен](https://dev.wildberries.ru/openapi/api-information#tag/authorization/Pravila-ispolzovaniya-tokenov-dostupa-k-API) по
// **Персональному** токену,
// **Сервисному** токену
//
// Метод удаляет товары из черновика поставки по списку баркодов.
//
// Баркоды не валидируются. Если в запросе вы передали некорректные баркоды, вы не получите ошибку. При этом корректные баркоды будут удалены из черновика.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- |
// | 1 мин | 30 запросов | 2 сек | 10 запросов |
//
// Параметры:
//   draftId - Строка - ID черновика
//   Тело - OrdersFbwModelsDraftDeleteitemsRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция DeleteV1DraftsDraftIdItems(Знач draftId, Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"DELETE",
		СтрШаблон("/api/supplies/v1/drafts/%1/items", Транспорт.ЭкранироватьСегмент(draftId)),
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://supplies-api.wildberries.ru");

КонецФункции

// Список черновиков
//
// Метод [доступен](https://dev.wildberries.ru/openapi/api-information#tag/authorization/Pravila-ispolzovaniya-tokenov-dostupa-k-API) по
// **Персональному** токену,
// **Сервисному** токену
//
// Метод возвращает список черновиков поставок.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- |
// | 1 мин | 30 запросов | 2 сек | 10 запросов |
//
// Параметры:
//   ДопПараметры - Структура, Соответствие - необязательные параметры:
//    * limit - Число - Количество черновиков в ответе
//    * offset - Число - Сколько элементов пропустить. Например, для значения 10 ответ начнется с 11 элемента
//    * sort - Строка - Сортировка: - `createdDt` — по дате создания черновика - `updatedDt` — по дате обновления черновика
//    * order - Строка - Порядок выдачи: - `desc` — по убыванию - `asc` — по возрастанию
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1Drafts(Знач ДопПараметры = Неопределено) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;

	ИменаЗаголовков = Новый Массив;
	Транспорт.РазложитьПараметры(ДопПараметры, ИменаЗаголовков, ПараметрыЗапроса, Заголовки);
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/supplies/v1/drafts",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://supplies-api.wildberries.ru");

КонецФункции

// Список товаров в черновике
//
// Метод [доступен](https://dev.wildberries.ru/openapi/api-information#tag/authorization/Pravila-ispolzovaniya-tokenov-dostupa-k-API) по
// **Персональному** токену,
// **Сервисному** токену
//
// Метод возвращает список товаров черновика.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- |
// | 1 мин | 30 запросов | 2 сек | 10 запросов |
//
// Параметры:
//   draftId - Строка - ID черновика
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1DraftsDraftIdItems(Знач draftId) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		СтрШаблон("/api/supplies/v1/drafts/%1/items", Транспорт.ЭкранироватьСегмент(draftId)),
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://supplies-api.wildberries.ru");

КонецФункции

// Детали поставки
//
// Метод возвращает детали поставки по ID.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 30 запросов | 2 сек | 10 запросов |
// | Сервисный | 1 мин | 30 запросов | 2 сек | 10 запросов |
// | Базовый с секретом | 1 мин | 30 запросов | 2 сек | 10 запросов |
// | Базовый | 1 ч | 2 запроса | 30 мин | 1 запрос |
//
// Параметры:
//   ID - Число - ID поставки или заказа
//   ДопПараметры - Структура, Соответствие - необязательные параметры:
//    * isPreorderID - Булево - Поиск по: - `true` — ID заказа, если в `ID` передаёте ID заказа - `false` — ID поставки, если в `ID` передаёте ID поставки
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1SuppliesId(Знач ID, Знач ДопПараметры = Неопределено) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;

	ИменаЗаголовков = Новый Массив;
	Транспорт.РазложитьПараметры(ДопПараметры, ИменаЗаголовков, ПараметрыЗапроса, Заголовки);
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		СтрШаблон("/api/v1/supplies/%1", Транспорт.ЭкранироватьСегмент(ID)),
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://supplies-api.wildberries.ru");

КонецФункции

// Товары поставки
//
// Метод возвращает информацию о товарах в поставке.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 30 запросов | 2 сек | 10 запросов |
// | Сервисный | 1 мин | 30 запросов | 2 сек | 10 запросов |
// | Базовый с секретом | 1 мин | 30 запросов | 2 сек | 10 запросов |
// | Базовый | 1 ч | 2 запроса | 30 мин | 1 запрос |
//
// Параметры:
//   ID - Число - ID поставки или заказа
//   ДопПараметры - Структура, Соответствие - необязательные параметры:
//    * limit - Число - Количество записей в ответе
//    * offset - Число - После какого элемента выдавать данные
//    * isPreorderID - Булево - Поиск по: - `true` — ID заказа, если в `ID` передаёте ID заказа - `false` — ID поставки, если в `ID` передаёте ID поставки
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1SuppliesIdGoods(Знач ID, Знач ДопПараметры = Неопределено) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;

	ИменаЗаголовков = Новый Массив;
	Транспорт.РазложитьПараметры(ДопПараметры, ИменаЗаголовков, ПараметрыЗапроса, Заголовки);
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		СтрШаблон("/api/v1/supplies/%1/goods", Транспорт.ЭкранироватьСегмент(ID)),
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://supplies-api.wildberries.ru");

КонецФункции

// Упаковка поставки
//
// Метод возвращает информацию об упаковке поставки.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 30 запросов | 2 сек | 10 запросов |
// | Сервисный | 1 мин | 30 запросов | 2 сек | 10 запросов |
// | Базовый с секретом | 1 мин | 30 запросов | 2 сек | 10 запросов |
// | Базовый | 1 ч | 2 запроса | 30 мин | 1 запрос |
//
// Параметры:
//   ID - Число - ID поставки
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1SuppliesIdPackage(Знач ID) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		СтрШаблон("/api/v1/supplies/%1/package", Транспорт.ЭкранироватьСегмент(ID)),
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://supplies-api.wildberries.ru");

КонецФункции

// Расхождения в поставке
//
// Метод [доступен](https://dev.wildberries.ru/openapi/api-information#tag/authorization/Pravila-ispolzovaniya-tokenov-dostupa-k-API) по
// **Персональному** токену,
// **Сервисному** токену
//
// Метод возвращает информацию о выявленных расхождениях между заявленным и фактическим количеством товара в поставке.
//
// Для поставок принятых не позднее года назад.
//
// \\*\\*Типы расхождений:\\*\\*
//
// Расхождение в большую сторону:
//
// 1. Избыток товара с заявленным баркодом:
// - `\"discrepancyType\": \"surplus\"`
// - `\"discrepancyLabel\": \"surplus\"`
// 2. Избыток товара с несоответствующим заявленному баркодом:
// - `\"discrepancyType\": \"surplus\"`
// - `\"discrepancyLabel\": \"re-sorting\"`
// Расхождение в меньшую сторону:
//
// 1. Не хватает товара:
// - `\"discrepancyType\": \"shortage\"`
// - `\"discrepancyLabel\": \"shortage\"`
// 2. Некоторые баркоды не соответствуют заявленным:
// - `\"discrepancyType\": \"shortage\"`
// - `\"discrepancyLabel\": \"re-sorting\"`
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- |
// | 1 мин | 1 запрос | 1 мин | 1 запрос |
//
// Параметры:
//   supplyId - Число - ID поставки
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1SuppliesSupplyIdDiscrepanciesQuantity(Знач supplyId) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		СтрШаблон("/api/supplies/v1/discrepancies/%1", Транспорт.ЭкранироватьСегмент(supplyId)),
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://supplies-api.wildberries.ru");

КонецФункции

// Транзитные направления
//
// Метод [временно отключён](https://dev.wildberries.ru/release-notes?id=570)
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 6 запросов | 10 сек | 10 запросов |
// | Сервисный | 1 мин | 6 запросов | 10 сек | 10 запросов |
// | Базовый с секретом | 1 мин | 6 запросов | 10 сек | 10 запросов |
// | Базовый | 12 ч | 1 запрос | 12 ч | 1 запрос |
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1TransitTariffs() Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/v1/transit-tariffs",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://supplies-api.wildberries.ru");

КонецФункции

// Список складов
//
// Метод [временно отключён](https://dev.wildberries.ru/release-notes?id=570)
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 6 запросов | 10 сек | 6 запросов |
// | Сервисный | 1 мин | 6 запросов | 10 сек | 6 запросов |
// | Базовый с секретом | 1 мин | 6 запросов | 10 сек | 6 запросов |
// | Базовый | 12 ч | 1 запрос | 12 ч | 1 запрос |
//
// ---
//
// В песочнице — максимум 1 запрос в секунду суммарно для всех методов.
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1Warehouses() Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/v1/warehouses",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://supplies-api.wildberries.ru");

КонецФункции

// Опции приёмки
//
// Метод [временно отключён](https://dev.wildberries.ru/release-notes?id=570)
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 6 запросов | 10 сек | 6 запросов |
// | Сервисный | 1 мин | 6 запросов | 10 сек | 6 запросов |
// | Базовый с секретом | 1 мин | 6 запросов | 10 сек | 6 запросов |
// | Базовый | 1 ч | 2 запроса | 30 мин | 1 запрос |
//
// ---
//
// В песочнице — максимум 1 запрос в секунду суммарно для всех методов.
//
// Параметры:
//   Тело - Массив
//   ДопПараметры - Структура, Соответствие - необязательные параметры:
//    * warehouseID - Число - ID склада. Если параметр не указан, возвращаются данные по всем складам. \\*\\*Максимум одно значение\\*\\*
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV1AcceptanceOptions(Знач Тело, Знач ДопПараметры = Неопределено) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;

	ИменаЗаголовков = Новый Массив;
	Транспорт.РазложитьПараметры(ДопПараметры, ИменаЗаголовков, ПараметрыЗапроса, Заголовки);
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/api/v1/acceptance/options",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://supplies-api.wildberries.ru");

КонецФункции

// Создать черновик
//
// Метод [доступен](https://dev.wildberries.ru/openapi/api-information#tag/authorization/Pravila-ispolzovaniya-tokenov-dostupa-k-API) по
// **Персональному** токену,
// **Сервисному** токену
//
// Метод создаёт пустой черновик поставки.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- |
// | 1 мин | 30 запросов | 2 сек | 10 запросов |
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV1Drafts() Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/api/supplies/v1/drafts",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://supplies-api.wildberries.ru");

КонецФункции

// Добавить товары в черновик
//
// Метод [доступен](https://dev.wildberries.ru/openapi/api-information#tag/authorization/Pravila-ispolzovaniya-tokenov-dostupa-k-API) по
// **Персональному** токену,
// **Сервисному** токену
//
// Метод добавляет товары в черновик поставки.
//
// Метод работает по принципу атомарности:
// - если все баркоды прошли валидацию успешно, то все товары добавятся в черновик. В ответе вернётся `{\"results\":[]}`
// - если хотя бы один баркод не прошел валидацию, ни один товар в черновик не добавится. В ответе вернётся список невалидных баркодов
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- |
// | 1 мин | 30 запросов | 2 сек | 10 запросов |
//
// Параметры:
//   draftId - Строка - ID черновика
//   Тело - OrdersFbwModelsDraftAdditemsRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV1DraftsDraftIdItems(Знач draftId, Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		СтрШаблон("/api/supplies/v1/drafts/%1/items", Транспорт.ЭкранироватьСегмент(draftId)),
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://supplies-api.wildberries.ru");

КонецФункции

// Список поставок
//
// Метод возвращает список поставок, по умолчанию — последние 1000 поставок.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 30 запросов | 2 сек | 10 запросов |
// | Сервисный | 1 мин | 30 запросов | 2 сек | 10 запросов |
// | Базовый с секретом | 1 мин | 30 запросов | 2 сек | 10 запросов |
// | Базовый | 1 ч | 2 запроса | 30 мин | 1 запрос |
//
// Параметры:
//   Тело - OrdersFbwModelsSuppliesFiltersRequest
//   ДопПараметры - Структура, Соответствие - необязательные параметры:
//    * limit - Число - Количество записей в ответе
//    * offset - Число - После какого элемента выдавать данные
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV1Supplies(Знач Тело, Знач ДопПараметры = Неопределено) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;

	ИменаЗаголовков = Новый Массив;
	Транспорт.РазложитьПараметры(ДопПараметры, ИменаЗаголовков, ПараметрыЗапроса, Заголовки);
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/api/v1/supplies",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://supplies-api.wildberries.ru");

КонецФункции

