// ReportsApi
//
// Класс сформирован автоматически (onescript) из спецификации OpenAPI.
// Правки будут потеряны при следующей генерации.
//
// Пример:
//   Настройки = Новый Конфигурация();
//   Настройки.УстановитьТокен("...");
//   Клиент = Новый ReportsApi(Настройки);

Перем Настройки Экспорт;
Перем Транспорт Экспорт;

Процедура ПриСозданииОбъекта(Знач ВходящиеНастройки)
	Настройки = ВходящиеНастройки;
	Транспорт = Новый ТранспортHTTP(Настройки);
КонецПроцедуры

// Создать отчёт
//
// Метод создаёт [задание на генерацию](https://dev.wildberries.ru/openapi/reports#tag/acceptanceExpenses/operation/getV1AcceptanceReportTasksTaskIdStatus) отчёта об [операциях при приёмке](https://dev.wildberries.ru/openapi/reports#tag/acceptanceExpenses/operation/getV1AcceptanceReportTasksTaskIdDownload).
//
// Можно получить отчёт максимум за 31 день.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 1 запрос | 1 мин | 1 запрос |
// | Сервисный | 1 мин | 1 запрос | 1 мин | 1 запрос |
// | Базовый с секретом | 1 мин | 1 запрос | 1 мин | 1 запрос |
// | Базовый | 3 ч | 1 запрос | 3 ч | 1 запрос |
//
// Параметры:
//   dateFrom - Строка - Начало отчётного периода, `ГГГГ-ММ-ДД`
//   dateTo - Строка - Конец отчётного периода, `ГГГГ-ММ-ДД`
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1AcceptanceReport(Знач dateFrom, Знач dateTo) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("dateFrom", dateFrom);
	ПараметрыЗапроса.Вставить("dateTo", dateTo);
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/v1/acceptance_report",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://seller-analytics-api.wildberries.ru");

КонецФункции

// Получить отчёт
//
// Метод возвращает отчёт об [операциях при приёмке](https://seller.wildberries.ru/analytics-reports/acceptance-report) по ID [задания на генерацию](https://dev.wildberries.ru/openapi/reports#tag/acceptanceExpenses/operation/getV1AcceptanceReport).
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 1 запрос | 1 мин | 1 запрос |
// | Сервисный | 1 мин | 1 запрос | 1 мин | 1 запрос |
// | Базовый с секретом | 1 мин | 1 запрос | 1 мин | 1 запрос |
// | Базовый | 1 ч | 2 запроса | 30 мин | 1 запрос |
//
// Параметры:
//   task_id - Строка - ID задания на генерацию
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1AcceptanceReportTasksTaskIdDownload(Знач task_id) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		СтрШаблон("/api/v1/acceptance_report/tasks/%1/download", Транспорт.ЭкранироватьСегмент(task_id)),
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://seller-analytics-api.wildberries.ru");

КонецФункции

// Проверить статус
//
// Метод возвращает статус [задания на генерацию](https://dev.wildberries.ru/openapi/reports#tag/acceptanceExpenses/operation/getV1AcceptanceReport) отчёта об [операциях при приёмке](https://dev.wildberries.ru/openapi/reports#tag/acceptanceExpenses/operation/getV1AcceptanceReportTasksTaskIdDownload).
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 5 сек | 1 запрос | 5 сек | 1 запрос |
// | Сервисный | 5 сек | 1 запрос | 5 сек | 1 запрос |
// | Базовый с секретом | 5 сек | 1 запрос | 5 сек | 1 запрос |
// | Базовый | 1 ч | 2 запроса | 30 мин | 1 запрос |
//
// Параметры:
//   task_id - Строка - ID задания на генерацию
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1AcceptanceReportTasksTaskIdStatus(Знач task_id) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		СтрШаблон("/api/v1/acceptance_report/tasks/%1/status", Транспорт.ЭкранироватьСегмент(task_id)),
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://seller-analytics-api.wildberries.ru");

КонецФункции

// Самовыкупы
//
// Метод возвращает отчёт об удержаниях за самовыкупы. Отчёт формируется каждую неделю по средам, до 7:00 по московскому времени, и содержит данные за одну неделю.
//
// Удержание за самовыкуп — 30% от стоимости товаров.
// Минимальная сумма всех удержаний — 100 000 ₽, если за неделю в ПВЗ привезли ваших товаров больше, чем на сумму 100 000 ₽.
//
// Данные доступны с августа 2023.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 10 мин | 1 запрос | 10 мин | 10 запросов |
// | Сервисный | 10 мин | 1 запрос | 10 мин | 10 запросов |
// | Базовый с секретом | 10 мин | 1 запрос | 10 мин | 10 запросов |
// | Базовый | 1 ч | 1 запрос | 1 ч | 1 запрос |
//
// Параметры:
//   ДопПараметры - Структура, Соответствие - необязательные параметры:
//    * date - Строка - Дата, которая входит в отчётный период, `ГГГГ-ММ-ДД`. Чтобы получить данные за всё время с августа 2023, не указывайте этот параметр
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1AnalyticsAntifraudDetails(Знач ДопПараметры = Неопределено) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;

	ИменаЗаголовков = Новый Массив;
	Транспорт.РазложитьПараметры(ДопПараметры, ИменаЗаголовков, ПараметрыЗапроса, Заголовки);
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/v1/analytics/antifraud-details",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://seller-analytics-api.wildberries.ru");

КонецФункции

// Получить отчёт
//
// Метод возвращает список [заблокированных карточек товаров продавца](https://seller.wildberries.ru/analytics-reports/banned-products) с причинами блокировки.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 10 сек | 1 запрос | 10 сек | 6 запросов |
// | Сервисный | 10 сек | 1 запрос | 10 сек | 6 запросов |
// | Базовый с секретом | 10 сек | 1 запрос | 10 сек | 6 запросов |
// | Базовый | 1 ч | 1 запрос | 1 ч | 1 запрос |
//
// Параметры:
//   sort - Строка - Сортировка - `brand` — по бренду - `nmId` — по артикулу WB - `title` — по наименованию товара - `vendorCode` — по артикулу продавца - `reason` — по причине блок…
//   order - Строка - Порядок выдачи - `desc` — от наибольшего числового значения к наименьшему, от последнего по алфавиту значения к первому - `asc` — от наименьшего числового значе…
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1AnalyticsBannedProducsBlocked(Знач sort, Знач order) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("sort", sort);
	ПараметрыЗапроса.Вставить("order", order);
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/v1/analytics/banned-products/blocked",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://seller-analytics-api.wildberries.ru");

КонецФункции

// Получить отчёт
//
// Метод возвращает отчёт о [доле бренда продавца в продажах](https://seller.wildberries.ru/analytics-reports/brand-share).
//
// Можно получить отчёт максимум за 365 дней. Данные доступны с 1 ноября 2022.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 5 сек | 1 запрос | 5 сек | 20 запросов |
// | Сервисный | 5 сек | 1 запрос | 5 сек | 20 запросов |
// | Базовый с секретом | 5 сек | 1 запрос | 5 сек | 20 запросов |
// | Базовый | 1 ч | 1 запрос | 1 ч | 1 запрос |
//
// Параметры:
//   parentId - Число - ID родительской категории
//   brand - Строка - Бренд
//   dateFrom - Строка - Начало отчётного периода, `ГГГГ-ММ-ДД`
//   dateTo - Строка - Конец отчётного периода, `ГГГГ-ММ-ДД`
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1AnalyticsBrandShare(Знач parentId, Знач brand, Знач dateFrom, Знач dateTo) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("parentId", parentId);
	ПараметрыЗапроса.Вставить("brand", brand);
	ПараметрыЗапроса.Вставить("dateFrom", dateFrom);
	ПараметрыЗапроса.Вставить("dateTo", dateTo);
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/v1/analytics/brand-share",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://seller-analytics-api.wildberries.ru");

КонецФункции

// Бренды продавца
//
// Метод возвращает список брендов продавца для отчёта о [доле бренда в продажах](https://seller.wildberries.ru/analytics-reports/brand-share).
//
// Можно получить только бренды, которые:
// - Продавались за последние 90 дней
// - Есть в наличии, вне зависимости от склада хранения
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 1 запрос | 1 мин | 10 запросов |
// | Сервисный | 1 мин | 1 запрос | 1 мин | 10 запросов |
// | Базовый с секретом | 1 мин | 1 запрос | 1 мин | 10 запросов |
// | Базовый | 1 ч | 1 запрос | 1 ч | 1 запрос |
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1AnalyticsBrandShareBrands() Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/v1/analytics/brand-share/brands",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://seller-analytics-api.wildberries.ru");

КонецФункции

// Родительские категории бренда
//
// Метод возвращает родительские категории бренда продавца для отчёта о [доле бренда в продажах](https://seller.wildberries.ru/analytics-reports/brand-share).
//
// Можно получить отчёт максимум за 365 дней. Данные доступны с 1 ноября 2022.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 5 сек | 1 запрос | 5 сек | 20 запросов |
// | Сервисный | 5 сек | 1 запрос | 5 сек | 20 запросов |
// | Базовый с секретом | 5 сек | 1 запрос | 5 сек | 20 запросов |
// | Базовый | 1 ч | 1 запрос | 1 ч | 1 запрос |
//
// Параметры:
//   brand - Строка - Бренд
//   dateFrom - Строка - Начало отчётного периода, `ГГГГ-ММ-ДД`
//   dateTo - Строка - Конец отчётного периода, `ГГГГ-ММ-ДД`
//   ДопПараметры - Структура, Соответствие - необязательные параметры:
//    * locale - Строка - Язык поля ответа `parentName`: - `ru` — русский - `en` — английский - `zh` — китайский
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1AnalyticsBrandShareParentSubjects(Знач brand, Знач dateFrom, Знач dateTo, Знач ДопПараметры = Неопределено) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("brand", brand);
	ПараметрыЗапроса.Вставить("dateFrom", dateFrom);
	ПараметрыЗапроса.Вставить("dateTo", dateTo);
	Заголовки = Новый Соответствие;

	ИменаЗаголовков = Новый Массив;
	Транспорт.РазложитьПараметры(ДопПараметры, ИменаЗаголовков, ПараметрыЗапроса, Заголовки);
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/v1/analytics/brand-share/parent-subjects",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://seller-analytics-api.wildberries.ru");

КонецФункции

// Маркировка товара
//
// Метод возвращает отчёт о штрафах за отсутствие обязательной маркировки товаров.
// В отчёте представлены фотографии товаров, на которых маркировка отсутствует либо не считывается.
//
// Можно получить данные максимум за 31 день. Данные доступны с марта 2024.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 1 запрос | 1 мин | 10 запросов |
// | Сервисный | 1 мин | 1 запрос | 1 мин | 10 запросов |
// | Базовый с секретом | 1 мин | 1 запрос | 1 мин | 10 запросов |
// | Базовый | 1 ч | 1 запрос | 1 ч | 1 запрос |
//
// Параметры:
//   dateFrom - Строка - Начало отчётного периода, `ГГГГ-ММ-ДД`
//   dateTo - Строка - Конец отчётного периода, `ГГГГ-ММ-ДД`
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1AnalyticsGoodsLabeling(Знач dateFrom, Знач dateTo) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("dateFrom", dateFrom);
	ПараметрыЗапроса.Вставить("dateTo", dateTo);
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/v1/analytics/goods-labeling",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://seller-analytics-api.wildberries.ru");

КонецФункции

// Получить отчёт
//
// Метод будет отключен [26 октября](https://dev.wildberries.ru/release-notes?id=577).
//
//
// Параметры:
//   dateFrom - Строка - Дата начала отчётного периода
//   dateTo - Строка - Дата окончания отчётного периода
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1AnalyticsGoodsReturn(Знач dateFrom, Знач dateTo) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("dateFrom", dateFrom);
	ПараметрыЗапроса.Вставить("dateTo", dateTo);
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/v1/analytics/goods-return",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://seller-analytics-api.wildberries.ru");

КонецФункции

// Получить отчёт
//
// Метод будет отключен [3 ноября](https://dev.wildberries.ru/release-notes?id=590).
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 10 сек | 1 запрос | 10 сек | 5 запросов |
// | Сервисный | 10 сек | 1 запрос | 10 сек | 5 запросов |
// | Базовый с секретом | 10 сек | 1 запрос | 10 сек | 5 запросов |
// | Базовый | 1 ч | 1 запрос | 1 ч | 1 запрос |
//
// Параметры:
//   dateFrom - Строка - Начало отчётного периода, `ГГГГ-ММ-ДД`
//   dateTo - Строка - Конец отчётного периода, `ГГГГ-ММ-ДД`
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1AnalyticsRegionSale(Знач dateFrom, Знач dateTo) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("dateFrom", dateFrom);
	ПараметрыЗапроса.Вставить("dateTo", dateTo);
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/v1/analytics/region-sale",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://seller-analytics-api.wildberries.ru");

КонецФункции

// Подмены и неверные вложения
//
// Метод возвращает отчёт об удержаниях за [подмены и неверные вложения](https://seller.wildberries.ru/analytics-reports/dimensions-penalties/retentions)
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 1 запрос | 1 мин | 1 запрос |
// | Сервисный | 1 мин | 1 запрос | 1 мин | 1 запрос |
// | Базовый с секретом | 1 мин | 1 запрос | 1 мин | 1 запрос |
// | Базовый | 1 ч | 4 запроса | 15 мин | 1 запрос |
//
// Параметры:
//   dateTo - Строка - Конец отчётного периода
//   limit - Число - Количество удержаний в ответе
//   ДопПараметры - Структура, Соответствие - необязательные параметры:
//    * dateFrom - Строка - Начало отчётного периода. По умолчанию используются дата и время, когда были впервые получены данные для отчёта
//    * sort - Строка - Сортировка: - `nmId` — по артикулу WB - `dtBonus` — по дате и времени удержания - `bonusSumm` — по сумме удержания
//    * order - Строка - Порядок выдачи: - `desc` — по убыванию - `asc` — по возрастанию
//    * offset - Число - Сколько элементов пропустить. Например, для значения `10` ответ начнётся с 11 элемента
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1Deductions(Знач dateTo, Знач limit, Знач ДопПараметры = Неопределено) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("dateTo", dateTo);
	ПараметрыЗапроса.Вставить("limit", limit);
	Заголовки = Новый Соответствие;

	ИменаЗаголовков = Новый Массив;
	Транспорт.РазложитьПараметры(ДопПараметры, ИменаЗаголовков, ПараметрыЗапроса, Заголовки);
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/analytics/v1/deductions",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://seller-analytics-api.wildberries.ru");

КонецФункции

// Получить отчёт
//
// Метод возвращает отчёт о [возвратах товаров продавцу](https://seller.wildberries.ru/return-transfer-reports).
//
//
// Параметры:
//   dateFrom - Строка - Дата начала отчётного периода
//   dateTo - Строка - Дата окончания отчётного периода
//   ДопПараметры - Структура, Соответствие - необязательные параметры:
//    * status - Строка - Статус возврата: - `archive` — архивный - `active` — активный
//    * limit - Число - Количество возвратов в ответе
//    * offset - Число - Сколько элементов пропустить. Например, для значения 10 ответ начнется с 11 элемента
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1GoodsReturn(Знач dateFrom, Знач dateTo, Знач ДопПараметры = Неопределено) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("dateFrom", dateFrom);
	ПараметрыЗапроса.Вставить("dateTo", dateTo);
	Заголовки = Новый Соответствие;

	ИменаЗаголовков = Новый Массив;
	Транспорт.РазложитьПараметры(ДопПараметры, ИменаЗаголовков, ПараметрыЗапроса, Заголовки);
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/analytics/v1/item-returns",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://seller-analytics-api.wildberries.ru");

КонецФункции

// Удержания за занижение габаритов упаковки
//
// Метод возвращает отчёт об [удержаниях за занижение габаритов упаковки](https://seller.wildberries.ru/analytics-reports/dimensions-penalties)
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 1 запрос | 1 мин | 1 запрос |
// | Сервисный | 1 мин | 1 запрос | 1 мин | 1 запрос |
// | Базовый с секретом | 1 мин | 1 запрос | 1 мин | 1 запрос |
// | Базовый | 6 ч | 1 запрос | 6 ч | 1 запрос |
//
// Параметры:
//   dateTo - Строка - Конец отчётного периода
//   limit - Число - Количество удержаний в ответе
//   ДопПараметры - Структура, Соответствие - необязательные параметры:
//    * dateFrom - Строка - Начало отчётного периода. По умолчанию используется дата, когда были впервые получены данные для отчёта
//    * offset - Число - Сколько элементов пропустить. Например, для значения `10` ответ начнётся с 11 элемента
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1MeasurementPenalties(Знач dateTo, Знач limit, Знач ДопПараметры = Неопределено) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("dateTo", dateTo);
	ПараметрыЗапроса.Вставить("limit", limit);
	Заголовки = Новый Соответствие;

	ИменаЗаголовков = Новый Массив;
	Транспорт.РазложитьПараметры(ДопПараметры, ИменаЗаголовков, ПараметрыЗапроса, Заголовки);
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/analytics/v1/measurement-penalties",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://seller-analytics-api.wildberries.ru");

КонецФункции

// Создать отчёт
//
// Метод создаёт [задание на генерацию](https://dev.wildberries.ru/openapi/reports#tag/paidStorage/operation/getV1PaidStorageTasksTaskIdStatus) отчёта о [платном хранении](https://dev.wildberries.ru/openapi/reports#tag/paidStorage/operation/getV1PaidStorageTasksTaskIdDownload).
//
// Можно получить отчёт максимум за 8 дней.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 1 запрос | 1 мин | 5 запросов |
// | Сервисный | 1 мин | 1 запрос | 1 мин | 5 запросов |
// | Базовый с секретом | 1 мин | 1 запрос | 1 мин | 5 запросов |
// | Базовый | 1 ч | 1 запрос | 1 ч | 1 запрос |
//
// Параметры:
//   dateFrom - Строка - Начало отчётного периода в формате RFC3339. Можно передать дату или дату со временем. Примеры: * `2019-06-20` * `2019-06-20T23:59:59` * `2019-06-20T00:00:00.123…
//   dateTo - Строка - Конец отчётного периода в формате RFC3339. Можно передать дату или дату со временем. Примеры: * `2019-06-20` * `2019-06-20T23:59:59` * `2019-06-20T00:00:00.1234…
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1PaidStorage(Знач dateFrom, Знач dateTo) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("dateFrom", dateFrom);
	ПараметрыЗапроса.Вставить("dateTo", dateTo);
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/v1/paid_storage",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://seller-analytics-api.wildberries.ru");

КонецФункции

// Получить отчёт
//
// Метод возвращает отчёт о [платном хранении](https://seller.wildberries.ru/analytics-reports/paid-storage/storage) по ID [задания на генерацию](https://dev.wildberries.ru/openapi/reports#tag/paidStorage/operation/getV1PaidStorage).
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 1 запрос | 1 мин | 1 запрос |
// | Сервисный | 1 мин | 1 запрос | 1 мин | 1 запрос |
// | Базовый с секретом | 1 мин | 1 запрос | 1 мин | 1 запрос |
// | Базовый | 1 ч | 2 запроса | 30 мин | 1 запрос |
//
// Параметры:
//   task_id - Строка - ID задания на генерацию
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1PaidStorageTasksTaskIdDownload(Знач task_id) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		СтрШаблон("/api/v1/paid_storage/tasks/%1/download", Транспорт.ЭкранироватьСегмент(task_id)),
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://seller-analytics-api.wildberries.ru");

КонецФункции

// Проверить статус
//
// Метод возвращает статус [задания на генерацию](https://dev.wildberries.ru/openapi/reports#tag/paidStorage/operation/getV1PaidStorage) отчёта о [платном хранении](https://dev.wildberries.ru/openapi/reports#tag/paidStorage/operation/getV1PaidStorageTasksTaskIdDownload).
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 5 сек | 1 запрос | 5 сек | 5 запросов |
// | Сервисный | 5 сек | 1 запрос | 5 сек | 5 запросов |
// | Базовый с секретом | 5 сек | 1 запрос | 5 сек | 5 запросов |
// | Базовый | 1 ч | 2 запроса | 30 мин | 2 запроса |
//
// Параметры:
//   task_id - Строка - ID задания на генерацию
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1PaidStorageTasksTaskIdStatus(Знач task_id) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		СтрШаблон("/api/v1/paid_storage/tasks/%1/status", Транспорт.ЭкранироватьСегмент(task_id)),
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://seller-analytics-api.wildberries.ru");

КонецФункции

// Заказы
//
// Метод возвращает информацию о заказах.
// Данные обновляются раз в 30 минут.
//
// 1 строка = 1 заказ = 1 сборочное задание = 1 единица товара.
// Для определения заказа рекомендуем использовать поле `srid`.
//
// Информация о заказе хранится 90 дней с момента оформления.
//
// В ответах могут отсутствовать заказы, по которым не подтверждена оплата. Например, заказы с отложенными платежами или оплатой в рассрочку. При этом, если по таким заказам есть продажи, вы можете получить их с помощью [детализаций к отчётам реализации](https://dev.wildberries.ru/openapi/documents-and-accounting#tag/financialReports).
// Чтобы получить все оформленные заказы, используйте [Ленту заказов](https://dev.wildberries.ru/openapi/analytics#tag/orderFeed).
//
// Данные этого отчёта являются предварительными и служат для оперативного мониторинга
//
// Для одного ответа на запрос с `flag=0` или без `flag` в системе установлено условное ограничение 80000 строк. Поэтому, чтобы получить все заказы, может потребоваться более, чем один запрос. Во втором и далее запросе в параметре `dateFrom` используйте полное значение поля `lastChangeDate` из последней строки ответа на предыдущий запрос.
// Если в ответе отдаётся пустой массив `[]`, все заказы уже выгружены.
//
// В песочнице для параметров `dateFrom` и `dateTo` можно задать диапазон только за последние 4 месяца от текущей даты.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 1 запрос | 1 мин | 10 запросов |
// | Сервисный | 1 мин | 1 запрос | 1 мин | 10 запросов |
// | Базовый с секретом | 1 мин | 1 запрос | 1 мин | 10 запросов |
// | Базовый | 3 ч | 1 запрос | 3 ч | 1 запрос |
//
// Параметры:
//   dateFrom - Строка - Дата и время последнего изменения по заказу. Дата в формате RFC3339. Можно передать дату или дату со временем. Время можно указывать с точностью до [секунд](./a…
//   ДопПараметры - Структура, Соответствие - необязательные параметры:
//    * flag - Число - Если параметр `flag=0` (или не указан в строке запроса), при вызове API возвращаются данные, у которых значение поля `lastChangeDate` (дата время обновления инф…
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1SupplierOrders(Знач dateFrom, Знач ДопПараметры = Неопределено) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("dateFrom", dateFrom);
	Заголовки = Новый Соответствие;

	ИменаЗаголовков = Новый Массив;
	Транспорт.РазложитьПараметры(ДопПараметры, ИменаЗаголовков, ПараметрыЗапроса, Заголовки);
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/v1/supplier/orders",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://statistics-api.wildberries.ru");

КонецФункции

// Продажи
//
// Метод возвращает информацию о продажах и возвратах.
// Данные обновляются раз в 30 минут.
//
// 1 строка = 1 заказ = 1 сборочное задание = 1 единица товара.
// Для определения заказа рекомендуем использовать поле `srid`.
//
// Информация о заказе хранится 90 дней с момента оформления.
//
// Данные этого отчёта являются предварительными и служат для оперативного мониторинга
//
// - В ответах могут отсутствовать заказы, по которым не подтверждена оплата, даже если эти заказы есть в детализациях к отчётам реализации. Например, заказы с отложенными платежами или оплатой в рассрочку
// - Значения полей `priceWithDisc` и `forPay` рассчитываются по упрощённой логике и могут отличаться от `retail\\_price\\_withdisc\\_rub` и `ppvz\\_for\\_pay` соответственно в детализациях к отчётам реализации
// - Поля `finishedPrice`, `priceWithDisc`, `forPay` могут временно иметь значение `0`: данные заполняются асинхронно, актуализируются в течение 24 часов
// - Для заказов, которые оплачены в валюте, отличной от валюты продавца, возможны округления цен из-за конвертации валют
// Для точных финансовых расчётов, сверки и отчётности используйте [детализации к отчётам реализации](https://dev.wildberries.ru/openapi/documents-and-accounting#tag/financialReports).
//
// Для одного ответа на запрос с `flag=0` или без `flag` в системе установлено условное ограничение 80000 строк. Поэтому, чтобы получить все продажи и возвраты, может потребоваться более, чем один запрос. Во втором и далее запросе в параметре `dateFrom `используйте полное значение поля `lastChangeDate` из последней строки ответа на предыдущий запрос.
// Если в ответе отдаётся пустой массив `[]`, все продажи и возвраты уже выгружены.
//
// В песочнице для параметров `dateFrom` и `dateTo` можно задать диапазон только за последние 4 месяца от текущей даты.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 1 запрос | 1 мин | 1 запрос |
// | Сервисный | 1 мин | 1 запрос | 1 мин | 1 запрос |
// | Базовый с секретом | 1 мин | 1 запрос | 1 мин | 1 запрос |
// | Базовый | 2 ч | 1 запрос | 2 ч | 1 запрос |
//
// Параметры:
//   dateFrom - Строка - Дата и время последнего изменения по продаже/возврату. Дата в формате RFC3339. Можно передать дату или дату со временем. Время можно указывать с точностью до [с…
//   ДопПараметры - Структура, Соответствие - необязательные параметры:
//    * flag - Число - Если параметр `flag=0` (или не указан в строке запроса), при вызове API возвращаются данные, у которых значение поля `lastChangeDate` (дата время обновления инф…
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1SupplierSales(Знач dateFrom, Знач ДопПараметры = Неопределено) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("dateFrom", dateFrom);
	Заголовки = Новый Соответствие;

	ИменаЗаголовков = Новый Массив;
	Транспорт.РазложитьПараметры(ДопПараметры, ИменаЗаголовков, ПараметрыЗапроса, Заголовки);
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/v1/supplier/sales",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://statistics-api.wildberries.ru");

КонецФункции

// Замеры склада
//
// Метод возвращает отчёт о [замерах склада](https://seller.wildberries.ru/analytics-reports/dimensions-penalties/warehouse-measurements)
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 1 запрос | 1 мин | 1 запрос |
// | Сервисный | 1 мин | 1 запрос | 1 мин | 1 запрос |
// | Базовый с секретом | 1 мин | 1 запрос | 1 мин | 1 запрос |
// | Базовый | 6 ч | 1 запрос | 6 ч | 1 запрос |
//
// Параметры:
//   dateTo - Строка - Конец отчётного периода
//   limit - Число - Количество замеров в ответе
//   ДопПараметры - Структура, Соответствие - необязательные параметры:
//    * dateFrom - Строка - Начало отчётного периода. По умолчанию используется дата, когда были впервые получены данные для отчёта
//    * offset - Число - Сколько элементов пропустить. Например, для значения `10` ответ начнётся с 11 элемента
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1WarehouseMeasurements(Знач dateTo, Знач limit, Знач ДопПараметры = Неопределено) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("dateTo", dateTo);
	ПараметрыЗапроса.Вставить("limit", limit);
	Заголовки = Новый Соответствие;

	ИменаЗаголовков = Новый Массив;
	Транспорт.РазложитьПараметры(ДопПараметры, ИменаЗаголовков, ПараметрыЗапроса, Заголовки);
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/analytics/v1/warehouse-measurements",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://seller-analytics-api.wildberries.ru");

КонецФункции

// Создать отчёт
//
// Метод создаёт [задание на генерацию](https://dev.wildberries.ru/openapi/reports#tag/warehousesInventoryReport/operation/getV1WarehouseRemainsTasksTaskIdStatus) отчёта об [остатках на складах WB](https://dev.wildberries.ru/openapi/reports#tag/warehousesInventoryReport/operation/getV1WarehouseRemainsTasksTaskIdDownload).
//
// Параметры `groupBy` и `filter` (группировки и фильтры) можно задать в любой комбинации — аналогично [версии](https://seller.wildberries.ru/analytics-reports/warehouse-remains) в личном кабинете.
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 1 запрос | 1 мин | 5 запросов |
// | Сервисный | 1 мин | 1 запрос | 1 мин | 5 запросов |
// | Базовый с секретом | 1 мин | 1 запрос | 1 мин | 5 запросов |
// | Базовый | 1 ч | 4 запроса | 15 мин | 1 запрос |
//
// Параметры:
//   ДопПараметры - Структура, Соответствие - необязательные параметры:
//    * locale - Строка - Язык полей ответа `subjectName` и `warehouseName`: - `ru` — русский - `en` — английский - `zh` — китайский. Значения `warehouseName` на английском
//    * groupByBrand - Булево - Разбивка по брендам
//    * groupBySubject - Булево - Разбивка по предметам
//    * groupBySa - Булево - Разбивка по артикулам продавца
//    * groupByNm - Булево - Разбивка по артикулам WB. Если `groupByNm=true`, в ответе будет поле `volume`
//    * groupByBarcode - Булево - Разбивка по баркодам
//    * groupBySize - Булево - Разбивка по размерам
//    * filterPics - Число - Фильтр по фото: - `-1` — без фото - `0` — не применять фильтр - `1` — с фото
//    * filterVolume - Число - Фильтр по объёму: - `-1` — без габаритов - `0` — не применять фильтр - `3` — свыше трёх литров
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1WarehouseRemains(Знач ДопПараметры = Неопределено) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;

	ИменаЗаголовков = Новый Массив;
	Транспорт.РазложитьПараметры(ДопПараметры, ИменаЗаголовков, ПараметрыЗапроса, Заголовки);
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/v1/warehouse_remains",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://seller-analytics-api.wildberries.ru");

КонецФункции

// Получить отчёт
//
// Метод возвращает отчёт об [остатках на складах WB](https://seller.wildberries.ru/analytics-reports/warehouse-remains) по ID [задания на генерацию](https://dev.wildberries.ru/openapi/reports#tag/warehousesInventoryReport/operation/getV1WarehouseRemains).
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 1 мин | 1 запрос | 1 мин | 1 запрос |
// | Сервисный | 1 мин | 1 запрос | 1 мин | 1 запрос |
// | Базовый с секретом | 1 мин | 1 запрос | 1 мин | 1 запрос |
// | Базовый | 1 ч | 4 запроса | 15 мин | 1 запрос |
//
// Параметры:
//   task_id - Строка - ID задания на генерацию
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1WarehouseRemainsTasksTaskIdDownload(Знач task_id) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		СтрШаблон("/api/v1/warehouse_remains/tasks/%1/download", Транспорт.ЭкранироватьСегмент(task_id)),
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://seller-analytics-api.wildberries.ru");

КонецФункции

// Проверить статус
//
// Метод возвращает статус [задания на генерацию](https://dev.wildberries.ru/openapi/reports#tag/warehousesInventoryReport/operation/getV1WarehouseRemains) отчёта об [остатках на складах WB](https://dev.wildberries.ru/openapi/reports#tag/warehousesInventoryReport/operation/getV1WarehouseRemainsTasksTaskIdDownload).
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 5 сек | 1 запрос | 5 сек | 5 запросов |
// | Сервисный | 5 сек | 1 запрос | 5 сек | 5 запросов |
// | Базовый с секретом | 5 сек | 1 запрос | 5 сек | 5 запросов |
// | Базовый | 1 ч | 4 запроса | 15 мин | 1 запрос |
//
// Параметры:
//   task_id - Строка - ID задания на генерацию
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1WarehouseRemainsTasksTaskIdStatus(Знач task_id) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		СтрШаблон("/api/v1/warehouse_remains/tasks/%1/status", Транспорт.ЭкранироватьСегмент(task_id)),
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://seller-analytics-api.wildberries.ru");

КонецФункции

// Получить отчёт
//
// Метод возвращает отчёт с [операциями по товарам с обязательной маркировкой](https://seller.wildberries.ru/analytics-reports/excise-report).
//
// Данный отчёт можно сохранить в [формате таблиц](https://dev.wildberries.ru/knowledge-base/articles/019d49a4-650c-7b04-9596-ba441936f9d3).
//
// [Лимит запросов](https://dev.wildberries.ru/openapi/api-information#tag/introduction/Limity-zaprosov) на один аккаунт продавца:
// | Тип | Период | Лимит | Интервал | Всплеск |
// | --- | --- | --- | --- | --- |
// | Персональный | 5 ч | 10 запросов | 30 мин | 10 запросов |
// | Сервисный | 5 ч | 10 запросов | 30 мин | 10 запросов |
// | Базовый с секретом | 5 ч | 10 запросов | 30 мин | 10 запросов |
// | Базовый | 24 ч | 2 запроса | 12 ч | 1 запрос |
//
// Параметры:
//   dateFrom - Строка - Начало отчётного периода, `ГГГГ-ММ-ДД`
//   dateTo - Строка - Конец отчётного периода, `ГГГГ-ММ-ДД`
//   Тело - ReportsExciseReportRequest
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция PostV1AnalyticsExciseReport(Знач dateFrom, Знач dateTo, Знач Тело) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("dateFrom", dateFrom);
	ПараметрыЗапроса.Вставить("dateTo", dateTo);
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"POST",
		"/api/v1/analytics/excise-report",
		ПараметрыЗапроса,
		Заголовки,
		Тело,
		"https://seller-analytics-api.wildberries.ru");

КонецФункции

