// ОтчётОВозвратахИПеремещенииТоваровApi
//
// Класс сформирован автоматически (onescript) из спецификации OpenAPI.
// Правки будут потеряны при следующей генерации.
//
// Пример:
//   Настройки = Новый Конфигурация();
//   Настройки.УстановитьТокен("...");
//   Клиент = Новый ОтчётОВозвратахИПеремещенииТоваровApi(Настройки);

Перем Настройки Экспорт;
Перем Транспорт Экспорт;

Процедура ПриСозданииОбъекта(Знач ВходящиеНастройки)
	Настройки = ВходящиеНастройки;
	Транспорт = Новый ТранспортHTTP(Настройки);
КонецПроцедуры

// Получить отчёт
//
// Метод будет отключен [26 октября](https://dev.wildberries.ru/release-notes?id=577).
//
//
// Параметры:
//   dateFrom - Строка - Дата начала отчётного периода
//   dateTo - Строка - Дата окончания отчётного периода
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1AnalyticsGoodsReturn(Знач dateFrom, Знач dateTo) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("dateFrom", dateFrom);
	ПараметрыЗапроса.Вставить("dateTo", dateTo);
	Заголовки = Новый Соответствие;
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/v1/analytics/goods-return",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://seller-analytics-api.wildberries.ru");

КонецФункции

// Получить отчёт
//
// Метод возвращает отчёт о [возвратах товаров продавцу](https://seller.wildberries.ru/return-transfer-reports).
//
//
// Параметры:
//   dateFrom - Строка - Дата начала отчётного периода
//   dateTo - Строка - Дата окончания отчётного периода
//   ДопПараметры - Структура, Соответствие - необязательные параметры:
//    * status - Строка - Статус возврата: - `archive` — архивный - `active` — активный
//    * limit - Число - Количество возвратов в ответе
//    * offset - Число - Сколько элементов пропустить. Например, для значения 10 ответ начнется с 11 элемента
//
// Возвращаемое значение:
//   ОтветAPI
//
Функция GetV1GoodsReturn(Знач dateFrom, Знач dateTo, Знач ДопПараметры = Неопределено) Экспорт

	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("dateFrom", dateFrom);
	ПараметрыЗапроса.Вставить("dateTo", dateTo);
	Заголовки = Новый Соответствие;

	ИменаЗаголовков = Новый Массив;
	Транспорт.РазложитьПараметры(ДопПараметры, ИменаЗаголовков, ПараметрыЗапроса, Заголовки);
	Возврат Транспорт.ВыполнитьЗапрос(
		"GET",
		"/api/analytics/v1/item-returns",
		ПараметрыЗапроса,
		Заголовки,
		Неопределено,
		"https://seller-analytics-api.wildberries.ru");

КонецФункции

